[{
  "_id": 236021,
  "adult": false,
  "name": "Camilla Luddington",
  "biography": "Born and raised near London in Berkshire, England, Luddington's love of acting began when she started performing for her family and directing her younger brother at age 5. By 11 she had her first agent and appeared in local theatre productions. While continuing with theatre, she studied in the Theatre Arts program at the prestigious Italia Conti Academy in London, before coming to Hollywood in 2007.\n\nCamilla burst into the acting world in the iconic role of Kate Middleton in the Lifetime movie \"William and Kate.\" Airing the week of the Royal Wedding, the ratings were the second highest in Lifetime's history, and the movie proved to be a worldwide success. Luddington portrays another iconic woman, Lara Croft, in the video game \"Tomb Raider,\" produced by Crystal Dynamics. She was praised for giving \"Tomb Raider\" a much needed reboot. Within 48 hours of the game's release in March of 2013, it sold over 1 million copies. Luddington had a major recurring role opposite David Duchovny and Evan Handler on the critically acclaimed Showtime series, \"Californication,\" in 2012, portraying sweet English nanny Lizzie, an aspiring actress who would do whatever it takes to make it in L.A. In 2012 she also recurred on the award-winning HBO series \"True Blood,\" as Claudette, a fairy who helps protects Sookie (Anna Paquin) and educates her on the world of fairies.\n\nLuddington has appeared in various television series, including, \"The Defenders,\" \"CSI: Crime Scene Investigation,\" \"The Forgotten,\" Nickelodeon's \"Big Time Rush\" and \"Days of our Lives.\" She co-wrote, co-directed and appeared in a short comedy \"The Filming of Shakey Willis.\"\n\nLuddington currently resides in Los Angeles.",
  "also_known_as": [],
  "birthday": "1983-12-15",
  "deathday": null,
  "popularity": 10.082,
  "homepage": null,
  "imdb_id": "nm2569832",
  "known_for_department": "Acting",
  "place_of_birth": "Ascot, Berkshire, England, UK",
  "gender": 1,
  "profile_path": "/eKF5lSEdEtOCbsgb5mKjd8vYLck.jpg"
},
{
  "_id": 1467169,
  "adult": false,
  "name": "Kaitlyn Bernard",
  "biography": "",
  "also_known_as": [
    "ケイトリン・バーナード"
  ],
  "birthday": "2000-11-28",
  "deathday": null,
  "popularity": 3.95,
  "homepage": null,
  "imdb_id": "nm5305557",
  "known_for_department": "Acting",
  "place_of_birth": "Canada ",
  "gender": 1,
  "profile_path": "/dllK1fxLKBW7Ijjou08O3K8tNvW.jpg"
},
{
  "_id": 378,
  "adult": false,
  "name": "Jonathan Pryce",
  "biography": "Jonathan Pryce, CBE (born June 1, 1947) is a Welsh stage and film actor and singer.\n\nAfter studying at the Royal Academy of Dramatic Art and meeting his long time partner, English actress Kate Fahy, in 1974, he began his career as a stage actor in the 1970s. His work in theatre, including an award-winning performance in the title role of the Royal Court Theatre's \"Hamlet\", led to several supporting roles in film and television. He made his breakthrough screen performance in Terry Gilliam's 1985 cult film \"Brazil\". Critically lauded for his versatility, Pryce has participated in big-budget films such as \"Evita\", \"Tomorrow Never Dies\", \"Pirates of the Caribbean\" and \"The New World\", as well as independent projects such as \"Glengarry Glen Ross\" and \"Carrington\". His career in theatre has also been prolific, and he has won two Tony Awards—the first in 1977 for his Broadway debut in \"Comedians\", the second for his 1991 role as \"The Engineer\" in the musical \"Miss Saigon\".",
  "also_known_as": [
    "Джонатан Прайс",
    "조너선 프라이스",
    "乔纳森·普雷斯"
  ],
  "birthday": "1947-06-01",
  "deathday": null,
  "popularity": 18.321,
  "homepage": null,
  "imdb_id": "nm0000596",
  "known_for_department": "Acting",
  "place_of_birth": "Carmel, Flintshire, Wales, UK",
  "gender": 2,
  "profile_path": "/zwSv5uXzPTtmitFe39UdqnVwmdL.jpg"
},
{
  "_id": 1215525,
  "adult": false,
  "name": "Jorge Garcia",
  "biography": "Jorge García (born April 28, 1973, height 5' 11½\" (1,82 m)) is an American actor and comedian. He first came to public attention with his performance as Hector Lopez on the television show Becker and later for his portrayal of Hugo \"Hurley\" Reyes in the television series Lost. Garcia also performs as a stand-up comedian. He most recently starred in the FOX television series Alcatraz, as well as playing a minor character on ABC's Once Upon a Time. García was born in Omaha, Nebraska. His mother, Dora Mesa, is a Cuban-born professor, and his father, Humberto Garcia, is a Chilean-born doctor. He grew up in Southern California and went to San Clemente High School. As a senior, he was selected by the faculty as \"Triton of the Year\", the highest award given to a graduating senior.\n\nGarcia graduated from the University of California Los Angeles (UCLA) in 1995 as a Communication Studies major.\n\nGarcía was the first actor to be cast on Lost after the producers saw him on Curb Your Enthusiasm the night before casting began, and created the character of Hugo Reyes specifically for him. García appeared in the second episode of the eighth season of Celebrity Poker Showdown, where he lost to Michael Ian Black. He was a contestant on an episode of Russian Roulette on Game Show Network. He missed a question about the Boxer Rebellion of 1900 and fell through the trap door.\n\nGarcia is scheduled to star in the movie When We Were Pirates due out in 2012. In the independent film, he will play a man named Jason, who along with a group of close friends, learn that their childhood love of playing pirates helps them overcome some of the difficulties they face later in their lives. He is also seen singing in the studio for the upcoming project on an officially released YouTube clip. During Lost's run, Garcia wrote a blog about the show called Dispatches from the Island. He also hosted a weekly podcast, Geronimo Jack's Beard, in which he discussed the script of Season 6 along with his then girlfriend Bethany Leigh Shady.\n\nGarcia is also featured on the front cover of Weezer's album Hurley, released on September 10, 2010. The album is named after his character from Lost. He performed as a guest vocalist at several Weezer concerts in 2010.\n\nOn 21 November 2010, Entertainment Weekly announced that Garcia was cast in the upcoming U.S. television series Alcatraz. On 23 November 2010, Garcia made a guest appearance on How I Met Your Mother's episode \"Blitzgiving\". In the episode references are made to Garcia's time on Lost. In 2011, Garcia appeared as a recurring character in Mr. Sunshine, portraying a caretaker at the Sunshine Center. Starting in January 2012, Garcia portrayed Dr. Diego Soto, an Alcatraz expert, in the FOX series, Alcatraz. The show was a mid-season replacement for Fox's Terra Nova. Despite an impressive start, the series was officially cancelled by Fox on May 9, 2012, due to dropping viewership throughout its run. Garcia appeared on The Nerdist podcast posted June 18, 2012. In 2013, Garcia played Steve Wozniak in the parody film, iSteve produced for the Funny or Die website.",
  "also_known_as": [
    " Jorge Fernando Garcia "
  ],
  "birthday": "1973-04-28",
  "deathday": null,
  "popularity": 12.688,
  "homepage": null,
  "imdb_id": "nm0306201",
  "known_for_department": "Acting",
  "place_of_birth": "Omaha, Nebraska, USA",
  "gender": 2,
  "profile_path": "/fcAzP3fCI2sOV8APKe0KFmG66uB.jpg"
},
{
  "_id": 496470,
  "adult": false,
  "name": "Jake Lacy",
  "biography": "Jake Lacy (born February 14, 1985) is an American actor. He is known for his portrayal of Pete Miller on the ninth and final season of The Office and as a co-lead as Casey Marion Davenport on the ABC sitcom Better with You (2010–11). He starred with Jenny Slate in the 2014 film Obvious Child and opposite Rooney Mara in Carol (2015). He played Olivia Wilde's character's love interest in Love the Coopers in 2016, and has also starred as Nick Beverly on the Showtime series I'm Dying Up Here (2017–18).\n\nLacy grew up in Vermont, where he attended Otter Valley Union High School. In 2008, Lacy graduated from the University of North Carolina School of the Arts (UNCSA) in Winston-Salem. After graduation, he worked odd jobs in the state of New York. He worked as a gym receptionist, a bar-back at a club and a waiter, while going to auditions during the day, until being cast in the role of Casey in Better with You.",
  "also_known_as": [
    "제이크 레이시 "
  ],
  "birthday": "1985-02-14",
  "deathday": null,
  "popularity": 13.373,
  "homepage": null,
  "imdb_id": "nm3821405",
  "known_for_department": "Acting",
  "place_of_birth": "Greenfield, Massachusetts, USA",
  "gender": 2,
  "profile_path": "/pr4svnjNSXNUl5DzDF1IiJrSbK7.jpg"
},
{
  "_id": 1939158,
  "adult": false,
  "name": "Ben Rosenbaum",
  "biography": "",
  "also_known_as": [],
  "birthday": null,
  "deathday": null,
  "popularity": 2.161,
  "homepage": null,
  "imdb_id": "nm5139594",
  "known_for_department": "Acting",
  "place_of_birth": null,
  "gender": 2,
  "profile_path": "/dqgWkeANfwtlnKbXaYy8zWQXQYQ.jpg"
},
{
  "_id": 49265,
  "adult": false,
  "name": "Lindsay Lohan",
  "biography": "Lindsay Dee Lohan (born July 2, 1986) is an American actress and singer. Born in New York City and raised on Long Island, Lohan was signed to Ford Models at the age of three. Having appeared as a regular on the television soap opera Another World at age 10, her breakthrough came in the Walt Disney Pictures film The Parent Trap (1998). The film's success led to appearances in the television films Life-Size (2000) and Get a Clue (2002), and the big-screen productions Freaky Friday (2003) and Confessions of a Teenage Drama Queen (2004). Lohan's early work won her childhood stardom, while the teen comedy sleeper hit Mean Girls (2004) affirmed her status as a teen idol and established her as a Hollywood leading actress.\n\nLohan became known as a triple threat after signing with Casablanca Records and releasing two studio albums, the platinum-certified Speak (2004) and gold-certified A Little More Personal (Raw) (2005). She also starred in the comedies Herbie: Fully Loaded (2005) and Just My Luck (2006). In order to showcase her range, Lohan began choosing roles in independent films such as A Prairie Home Companion and Bobby (both 2006) and Chapter 27 (2007).\n\nIn 2013, under the guidance of Oprah Winfrey, Lohan filmed the docu-series Lindsay (2014), which depicted her returning to work. She subsequently made her stage debut in the London West End production of Speed-the-Plow (2014), starred in the second season of the comedy series Sick Note (2018), and served as a panelist in the first season of Masked Singer Australia (2019). Between 2016 and 2018, she opened three beach clubs in Greece, which were the focus of the MTV reality television series Lindsay Lohan's Beach Club (2019). After signing a multi-picture deal with Netflix, Lohan starred in the romantic comedy Falling for Christmas (2022).",
  "also_known_as": [
    "Λίντσεϊ Ντι Λόχαν ",
    "ლინდსი ლოჰანი",
    "琳賽·蘿涵",
    "Ліндсі Лохан"
  ],
  "birthday": "1986-07-02",
  "deathday": null,
  "popularity": 47.299,
  "homepage": "http://www.lindsaylohanofficial.com/",
  "imdb_id": "nm0517820",
  "known_for_department": "Acting",
  "place_of_birth": "New York City, New York, USA",
  "gender": 1,
  "profile_path": "/y59roEK1QZqoWhWPlzgWVDmJarq.jpg"
},
{
  "_id": 134235,
  "adult": false,
  "name": "Jake Hoffman",
  "biography": "From Wikipedia, the free encyclopedia.\n\nJacob Edward \"Jake\" Hoffman (born March 20, 1981) is an American actor.\n\nHe was born in Los Angeles County, California, the son of actor Dustin Hoffman and Lisa Hoffman (née Gottsegen). He is best known for playing the adult version of Ben Newman in the 2006 comedy fantasy film Click. He and his father both appeared in Barney's Version with Dustin Hoffman cast as the father of the protagonist, and Jake as his grandson.\n\nDescription above from the Wikipedia article Jake Hoffman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "Jacob Edward Hoffman",
    "Jacob Hoffman",
    "제이크 호프만"
  ],
  "birthday": "1981-03-20",
  "deathday": null,
  "popularity": 7.827,
  "homepage": null,
  "imdb_id": "nm0388933",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 2,
  "profile_path": "/senKSj2L2aZdTaXThtb09XMGZpM.jpg"
},
{
  "_id": 31903,
  "adult": false,
  "name": "Henry Winkler",
  "biography": "Henry Franklin Winkler (born October 30, 1945) is an American actor, director, producer, and author.\n\nWinkler is best known for his role as Fonzie on the 1970s American sitcom Happy Days. \"The Fonz,\" a leather-clad greaser and auto mechanic, started out as a minor character at the show's beginning but had achieved top billing by the time the show ended.",
  "also_known_as": [
    "Henry Franklin Winkler"
  ],
  "birthday": "1945-10-30",
  "deathday": null,
  "popularity": 29.227,
  "homepage": null,
  "imdb_id": "nm0001857",
  "known_for_department": "Acting",
  "place_of_birth": "New York City, New York, USA",
  "gender": 2,
  "profile_path": "/c35LVOjB1gbY5iYzhN9PGIXUHWt.jpg"
},
{
  "_id": 3967,
  "adult": false,
  "name": "Kate Beckinsale",
  "biography": "Kathrin Romany Beckinsale (born 26 July 1973) is an English actress and model..\n\nShe first gained notice, while a student at Oxford University, for making her debut in the film adaptation of Shakespeare's Much Ado About Nothing. Throughout the 1990s, she worked on both film and television, most notably by portraying the title character in the 1996 BBC television series Emma.\n\nShe started film work in the United States in the late 1990s. She appeared in small-scale dramas The Last Days of Disco (1998) and Brokedown Palace (1999). In 2001, she garnered international recognition when she was cast as the romantic lead opposite Ben Affleck in her breakthrough film, Pearl Harbor (2001). She then starred in a number of films including the romantic comedy Serendipity (2001), Tiptoes (2003), The Aviator (2004), and Click (2006).\n\nSince playing the role of Selene in the Underworld film series (2003–2016), she has become known for her work in action films, including Van Helsing (2004), Whiteout (2009), Contraband (2012), and Total Recall (2012).\n\nIn 2016, she received critical acclaim for her performance in the period comedy film Love & Friendship, for which she received a nomination for the Critics' Choice Movie Award for Best Actress in a Comedy. She returned in action films with Jolt (2021). She also starred in two television projects with The Widow (2019) and Guilty Party (2021).",
  "also_known_as": [
    "Kathrin Beckinsale",
    "Кейт Бекинсэйл",
    "케이트 베킨세일",
    "Κέιτ Μπεκινσέιλ",
    "Kathrin Romary Beckinsale",
    "凯特·贝金赛尔",
    "凱特·貝琴薩",
    "Κάθριν Μπεκινσέιλ",
    "Κάθριν Ρόμιρι Μπεκινσέιλ",
    "キャスリン・ベイリー・ベッキンセイル",
    "ケイト・ベッキンセール"
  ],
  "birthday": "1973-07-26",
  "deathday": null,
  "popularity": 46.246,
  "homepage": null,
  "imdb_id": "nm0000295",
  "known_for_department": "Acting",
  "place_of_birth": "Chiswick, London, England, UK",
  "gender": 1,
  "profile_path": "/j8AX8zHixgntJ7FgIQWwI7NJ7p4.jpg"
},
{
  "_id": 5576,
  "adult": false,
  "name": "Val Kilmer",
  "biography": "Val Edward Kilmer (born December 31, 1959) is an American actor. Originally a stage actor, Kilmer became popular in the mid-1980s after a string of appearances in comedy films, starting with Top Secret! (1984), then the cult classic Real Genius (1985), as well as blockbuster action films, including a role in Top Gun and a lead role in Willow.\n\nDuring the 1990s, Kilmer gained critical respect after a series of films that were also commercially successful, including his roles as Jim Morrison in The Doors, Doc Holliday in 1993's Tombstone, Batman in 1995's Batman Forever, Chris Shiherlis in 1995's Heat and Simon Templar in 1997's The Saint. During the early 2000s, Kilmer appeared in several well-received roles, including The Salton Sea, Spartan, and supporting performances in Kiss Kiss Bang Bang, Alexander, and as the voice of KITT in Knight Rider.\n\n​From Wikipedia, the free encyclopedia",
  "also_known_as": [
    "Вэл Килмер",
    "발 킬머",
    "方·基默",
    "Val Edward Kilmer",
    "方·基墨"
  ],
  "birthday": "1959-12-31",
  "deathday": null,
  "popularity": 28.047,
  "homepage": "http://valkilmer.com",
  "imdb_id": "nm0000174",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 2,
  "profile_path": "/dZEGiq4XmCiXq9hmz0vVLId010z.jpg"
},
{
  "_id": 23931,
  "adult": false,
  "name": "Mira Sorvino",
  "biography": "Mira Katherine Sorvino (born September 28, 1967) is an American actress. She won the Academy Award and Golden Globe for Best Supporting Actress for her performance in Woody Allen's Mighty Aphrodite (1995).\n\nShe also starred in the films Romy and Michele's High School Reunion (1997), Mimic (1997), Lulu on the Bridge (1998), The Replacement Killers (1998), Summer of Sam (1999), Gods and Generals (2003), Like Dandelion Dust (2009), and Sound of Freedom (2023). For her work in television, she was nominated for a Primetime Emmy Award for Outstanding Lead Actress in a Limited Series or Movie for her portrayal of Marilyn Monroe in Norma Jean & Marilyn (1996), and twice nominated for a Golden Globe for Best Actress – Miniseries or Television Film, again for her performance as Marilyn Monroe and for her leading role in Human Trafficking (2005).\n\nDescription above from the Wikipedia article Mira Sorvino, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "Mira Katherine Sorvino"
  ],
  "birthday": "1967-09-28",
  "deathday": null,
  "popularity": 19.149,
  "homepage": null,
  "imdb_id": "nm0000227",
  "known_for_department": "Acting",
  "place_of_birth": "Manhattan, New York City, New York, USA",
  "gender": 1,
  "profile_path": "/11raFiNo7QfisH44v3NIfpVvIz5.jpg"
},
{
  "_id": 11084,
  "adult": false,
  "name": "Kelly McGillis",
  "biography": "Kelly Ann McGillis (born July 9, 1957) is an American actress whose movies include Witness, for which she received a Golden Globe nomination, Top Gun, and The Accused.\n\nDescription above from the Wikipedia article Kelly McGillis, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "켈리 맥길리스",
    "凱莉·麥吉利斯",
    "Келлі Макгілліс"
  ],
  "birthday": "1957-07-09",
  "deathday": null,
  "popularity": 27.8,
  "homepage": null,
  "imdb_id": "nm0000534",
  "known_for_department": "Acting",
  "place_of_birth": "Newport Beach, California, USA",
  "gender": 1,
  "profile_path": "/dozwem9ZtDgO4MMF8wzRDe6Wewn.jpg"
},
{
  "_id": 33259,
  "adult": false,
  "name": "Jennifer Love Hewitt",
  "biography": "Jennifer Love Hewitt (born February 21, 1979) is an American actress, producer and singer. Hewitt began her career as a child actress and singer, appearing in national television commercials before joining the cast of the Disney Channel series Kids Incorporated (1989–1991). She had her breakthrough as Sarah Reeves Merrin on the Fox teen drama Party of Five (1995–1999) and rose to fame as a teen star for her role as Julie James in the horror films I Know What You Did Last Summer (1997) and its 1998 sequel, as well as her role as Amanda Beckett in the teen comedy film Can't Hardly Wait (1998).\n\nHewitt's other notable films include Heartbreakers (2001), The Tuxedo (2002) and the two Garfield live-action films (2004–2006). She has starred as Melinda Gordon on the CBS supernatural drama Ghost Whisperer (2005–2010), Riley Parks on the Lifetime drama series The Client List (2012–2013), Special Agent Kate Callahan on the CBS crime drama Criminal Minds (2014–2015), and since 2018, Maddie Buckley on the Fox first-responder procedural 9-1-1. She was nominated for the Golden Globe Award for Best Actress – Miniseries or Television Film for The Client List pilot film (2010).\n\nIn music, Hewitt has released four studio albums to date. After her debut album, Love Songs (1992), was released at age 12 exclusively in Japan, she went on to record Let's Go Bang (1995), Jennifer Love Hewitt (1996) and BareNaked (2002), the latter of which became her first album to chart in the United States, peaking at number 37 on the Billboard 200 chart. Her most successful single on the Billboard Hot 100 chart was the 1999 release \"How Do I Deal\", which peaked at number 59. In addition to music and acting, Hewitt has served as a producer on some of her film and television projects. She has appeared in several magazines' lists of the world's most beautiful women.\n\nDescription above from the Wikipedia article Jennifer Love Hewitt, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "ジェニファー・ラブ・ヒューイット",
    "珍妮佛·樂芙·休伊",
    "Дженніфер Лав Хʼюїтт"
  ],
  "birthday": "1979-02-21",
  "deathday": null,
  "popularity": 27.512,
  "homepage": null,
  "imdb_id": "nm0001349",
  "known_for_department": "Acting",
  "place_of_birth": "Waco, Texas, USA",
  "gender": 1,
  "profile_path": "/gEDepjLEFGokSaexd1FzmtH1hlq.jpg"
},
{
  "_id": 182280,
  "adult": false,
  "name": "Daniel Eric Gold",
  "biography": "Daniel Eric Gold is an actor.",
  "also_known_as": [],
  "birthday": "1975-09-19",
  "deathday": null,
  "popularity": 5.942,
  "homepage": null,
  "imdb_id": "nm1896045",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 2,
  "profile_path": "/aRLAcNmCQiMNnqPWRaVTlf7enxi.jpg"
},
{
  "_id": 62564,
  "adult": false,
  "name": "Madeline Carroll",
  "biography": "Madeline Carroll (born March 18, 1996) is an American actress and she is best known for playing Julianna \"Juli\" Baker in her feature film Flipped.\n\nDescription above from the Wikipedia article Madeline Carroll, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "Maddie Carroll",
    "Mady Carroll",
    "Madelina Carroll"
  ],
  "birthday": "1996-03-18",
  "deathday": null,
  "popularity": 15.974,
  "homepage": null,
  "imdb_id": "nm1630992",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 1,
  "profile_path": "/rUXWRKgyf9vLoC4zSHlu5fHdtxR.jpg"
},
{
  "_id": 62168,
  "adult": false,
  "name": "Sasha Pieterse",
  "biography": "Sasha Pieterse (born 17 February 1996) is a South African-born American actress.  She is best known for her leading role as Alison DiLaurentis in the mystery-drama hit series \"Pretty Little Liars\" (2010-17) and in its spin-off \"Pretty Little Liars: The Perfectionists\" (2019).",
  "also_known_as": [],
  "birthday": "1996-02-17",
  "deathday": null,
  "popularity": 12.404,
  "homepage": null,
  "imdb_id": "nm1199888",
  "known_for_department": "Acting",
  "place_of_birth": "Johannesburg, South Africa",
  "gender": 1,
  "profile_path": "/9dRN9cDA4jpOFuYrIaaf2Ns4MVf.jpg"
},
{
  "_id": 113868,
  "adult": false,
  "name": "Matt Prokop",
  "biography": "From Wikipedia, the free encyclopedia.\n\nMatthew Ray Prokop (born July 29, 1990)[1] is an American former actor. He is known for his roles as Jimmie \"The Rocket Man\" Zara in the Disney film High School Musical 3: Senior Year (2008) and Josh Rosen in the Disney Channel Original Movie Geek Charming (2011).\n\nIn 2011, Prokop was represented by Management 360 and APA. His first acting job was a brief appearance on Hannah Montana in 2007, followed by a walk-on role on The Office.\n\nHe guest starred on Medium (2009) before landing a role in Furry Vengeance (2010) as Brendan Fraser's son. He featured in the 2011 Disney Channel Original Movie Geek Charming, based on author Robin Palmer's novel.\n\nIn 2012, he appeared in an episode of Modern Family, opposite then girlfriend and series regular Sarah Hyland. His last acting appearance was in the 2013 film April Apocalypse, with his last three film roles being in films starring Hyland.\n\nProkop dated his Geek Charming co-star Sarah Hyland for several years until August 2014, when she left him and filed a temporary restraining order against him for physically and verbally abusing her throughout their four-year relationship. In October 2014, a permanent restraining order was granted, and Prokop has not worked in the entertainment industry since.\n\nOn May 18, 2024, Prokop was arrested for alleged aggravated assault against his girlfriend following a public incident and for resisting arrest. Per the police, Prokop’s partner said he had shoved her and slammed her head into something. The officers on scene reportedly saw enough evidence of injury to arrest the High School Musical 3 star. Prokop, 33, was booked into Victoria County Jail on charges of aggravated assault with a weapon and resisting arrest.",
  "also_known_as": [],
  "birthday": "1990-07-29",
  "deathday": null,
  "popularity": 7.589,
  "homepage": null,
  "imdb_id": "nm2328628",
  "known_for_department": "Acting",
  "place_of_birth": "Victoria, Texas, USA",
  "gender": 2,
  "profile_path": "/dR0iivJAiKYkxK1ugbLlgPqM9Bb.jpg"
},
{
  "_id": 103,
  "adult": false,
  "name": "Mark Ruffalo",
  "biography": "Mark Alan Ruffalo (born November 22, 1967) is an American actor and producer. He began acting in the early 1990s and first gained recognition for his work in Kenneth Lonergan's play This Is Our Youth (1998) and drama film You Can Count on Me (2000). He went on to star in the romantic comedies 13 Going on 30 (2004) and Just like Heaven (2005) and the thrillers In the Cut (2003), Zodiac (2007) and Shutter Island (2010). He received a Tony Award nomination for his supporting role in the Broadway revival of Awake and Sing! in 2006. Ruffalo gained international recognition for playing Bruce Banner / Hulk in superhero films set in the Marvel Cinematic Universe, including The Avengers (2012), Avengers: Infinity War (2018), and Avengers: Endgame (2019).\n\nRuffalo gained nominations for the Academy Award for Best Supporting Actor for playing a sperm-donor in the comedy-drama The Kids Are All Right (2010), Dave Schultz in the biopic Foxcatcher (2014), and Michael Rezendes in the drama Spotlight (2015). He won the Screen Actors Guild Award for Best Actor in a TV Movie for playing a gay writer and activist in the television drama film The Normal Heart (2015), and the Primetime Emmy Award for Outstanding Lead Actor in a Limited Series or Movie for his dual role as identical twins in the miniseries I Know This Much Is True (2020). Ruffalo is one of the few performers to receive all four EGOT nominations.",
  "also_known_as": [
    "مارك رافالو",
    "마크 러펄로",
    "マーク・ラファロ",
    "马克·鲁法洛",
    "Μαρκ Ράφαλο",
    "馬克·盧法洛",
    "Mark Alan Ruffalo",
    "مارک رافلو",
    "מארק רפאלו",
    "มาร์ก แอลัน รัฟฟาโล"
  ],
  "birthday": "1967-11-22",
  "deathday": null,
  "popularity": 27.91,
  "homepage": null,
  "imdb_id": "nm0749263",
  "known_for_department": "Acting",
  "place_of_birth": "Kenosha, Wisconsin, USA",
  "gender": 2,
  "profile_path": "/z3dvKqMNDQWk3QLxzumloQVR0pv.jpg"
},
{
  "_id": 9278,
  "adult": false,
  "name": "Jennifer Garner",
  "biography": "Jennifer Anne Garner (born April 17, 1972) is an American actress. Born in Houston, Texas, and raised in Charleston, West Virginia, Garner studied theater at Denison University and began acting as an understudy for the Roundabout Theatre Company in New York City. She made her screen debut in the television adaptation of Danielle Steel's romance novel Zoya in 1995. She had guest television appearances and supporting film roles, as well as a featured role on the teen drama television series Time of Your Life (1999–2000) and a supporting role in the war drama Pearl Harbor (2001).\n\nGarner gained recognition for her leading performance as CIA officer Sydney Bristow in the ABC spy-action thriller television series Alias (2001–2006). For her work on the series, she won the Golden Globe for Best Actress – Television Series Drama and the Screen Actors Guild Award for Best Actress in a Television Drama, in addition to four consecutive nominations for the Primetime Emmy Award for Outstanding Lead Actress in a Drama Series. She received additional praise for her performance in the romantic comedy 13 Going on 30 (2004), and went on to portray Elektra in the superhero films Daredevil (2003) and Elektra (2005). She continued to achieve commercial success with performances in the comedy-drama Juno (2007), and the romantic comedies Ghosts of Girlfriends Past (2009) and Valentine's Day (2010).\n\nGarner had starring film roles in the fantasy-comedy The Invention of Lying (2009), the fantasy drama The Odd Life of Timothy Green (2012), and the biographic drama Dallas Buyers Club (2013), the latter of which earned her a nomination for the Screen Actors Guild Award for Outstanding Performance by a Cast in a Motion Picture. She went on to star in the family comedy Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014), the drama Miracles from Heaven (2016), the romantic comedy-drama Love, Simon (2018), the HBO comedy series Camping (2018), the action thriller Peppermint (2018) and action-comedy The Adam Project (2022). Garner has also produced and starred in the comedy Butter (2011) and the family adventure Yes Day (2021).\n\nGarner works as an activist for early childhood education and is a board member of Save the Children USA. She is the co-founder and chief brand officer of the organic baby food company Once Upon a Farm. She is also an advocate for anti-paparazzi campaigns among children of celebrities.",
  "also_known_as": [
    "詹妮弗·加纳",
    "Jennifer Anne Garner",
    "Τζένιφερ Αν Γκάρνερ",
    "Τζένιφερ Γκάρνερ",
    "제니퍼 가너",
    "Дженніфер Гарнер"
  ],
  "birthday": "1972-04-17",
  "deathday": null,
  "popularity": 53.834,
  "homepage": null,
  "imdb_id": "nm0004950",
  "known_for_department": "Acting",
  "place_of_birth": "Houston, Texas, USA",
  "gender": 1,
  "profile_path": "/ftymEXqdTnXfaI6dGd9qrJoFOSE.jpg"
},
{
  "_id": 58115,
  "adult": false,
  "name": "Eric Dane",
  "biography": "​Eric Dane (born Eric T. Melvin, November 9, 1972) is an American actor. After appearing in television roles throughout the 2000s with his recurring role as Jason Dean in Charmed being the best known, he became famous for playing Dr. Mark Sloan (McSteamy) on the medical drama television series Grey's Anatomy, as well as films, co-starring in Marley & Me (2008), Valentine's Day (2010), and Burlesque (2010). He starred as Captain Tom Chandler in the post-apocalyptic drama The Last Ship. He currently stars as Cal Jacobs in the HBO series, Euphoria.",
  "also_known_as": [
    " Eric William Dane ",
    "Eric T. Melvin",
    "에릭 데인",
    "艾瑞克·丹恩"
  ],
  "birthday": "1972-11-09",
  "deathday": null,
  "popularity": 37.414,
  "homepage": null,
  "imdb_id": "nm0199312",
  "known_for_department": "Acting",
  "place_of_birth": "San Francisco, California, USA",
  "gender": 2,
  "profile_path": "/5TIrP8s6GrhO7I2rfG0GPEIkRrY.jpg"
},
{
  "_id": 887,
  "adult": false,
  "name": "Owen Wilson",
  "biography": "Owen Cunningham Wilson (born November 18, 1968) is an American actor. He has had a long association with filmmaker Wes Anderson with whom he shared writing and acting credits for Bottle Rocket (1996), Rushmore (1998), and The Royal Tenenbaums (2001), the last of which earned him a nomination for the Academy Award and BAFTA Award for Best Screenplay. He has also appeared in Anderson's The Life Aquatic with Steve Zissou (2004), The Darjeeling Limited (2007), The Grand Budapest Hotel (2014), and The French Dispatch (2021). Wilson also starred in the Woody Allen romantic comedy Midnight in Paris (2011) as unsatisfied screenwriter Gil Pender, a role which earned him a Golden Globe Award nomination. In 2014 he appeared in Paul Thomas Anderson's Inherent Vice, and Peter Bogdanovich's She's Funny That Way.\n\nWilson is also known for his career as an onscreen comedian and member of the Frat Pack including starring in such comedies as Zoolander (2001), Starsky & Hutch (2004), Wedding Crashers (2005), You, Me and Dupree (2006), How Do You Know (2010), The Big Year (2011), and The Internship (2013). He is also known for the family films Marley and Me (2008), and the Night at the Museum film series (2005–2014). He voices Lightning McQueen in the Cars film series (2006–present), Coach Skip in Fantastic Mr. Fox (2009), the title character in Marmaduke (2010) and Reggie in Free Birds (2013). He stars as Mobius M. Mobius in the Disney+ series Loki (2021–present).\n\nWilson's accolades include an Oscar and BAFTA nomination for Best Original Screenplay (for The Royal Tenenbaums), a Golden Globe and two SAG acting nominations (for Midnight in Paris and The Grand Budapest Hotel) and an Independent Spirit Award (for Inherent Vice).\n\nDescription above from the Wikipedia article Owen Wilson, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "歐文·威爾森",
    "オーウェン・ウィルソン",
    "โอเวน วิลสัน",
    "أوين ويلسون",
    "Owen Cunningham Wilson",
    "Όουεν Κάνινγκχαμ Γουίλσον",
    "Оуен Вілсон",
    "오웬 윌슨",
    "ოუენ უილსონი",
    "אוון וילסון",
    "Owen C. Wilson"
  ],
  "birthday": "1968-11-18",
  "deathday": null,
  "popularity": 96.035,
  "homepage": null,
  "imdb_id": "nm0005562",
  "known_for_department": "Acting",
  "place_of_birth": "Dallas, Texas, USA",
  "gender": 2,
  "profile_path": "/ntN3DL1Us5G2PCvlfq112vLXRKa.jpg"
},
{
  "_id": 58754,
  "adult": false,
  "name": "Haley Bennett",
  "biography": "Haley Loraine Keeling (born January 7, 1988), known professionally as Haley Bennett, is an American actress. She made her film debut in the romantic comedy Music and Lyrics (2007) and has since appeared in films such as The Equalizer (2014), Swallow (2019), Hillbilly Elegy (2020), Cyrano (2021), and Magazine Dreams (2023).",
  "also_known_as": [
    "Haley Loraine Keeling",
    "헤일리 베넷",
    "ヘイリー・ベネット",
    "海莉·班奈特"
  ],
  "birthday": "1988-01-07",
  "deathday": null,
  "popularity": 50.259,
  "homepage": null,
  "imdb_id": "nm2247245",
  "known_for_department": "Acting",
  "place_of_birth": "Fort Myers, Florida, USA",
  "gender": 1,
  "profile_path": "/8HRgGypSwHeI27ffmcAELNoxIOw.jpg"
},
{
  "_id": 4491,
  "adult": false,
  "name": "Jennifer Aniston",
  "biography": "Jennifer Joanna Aniston (born February 11, 1969) is an American actress and producer. She rose to international fame for her role as Rachel Green on the television sitcom Friends from 1994 to 2004, for which she earned Primetime Emmy, Golden Globe, and Screen Actors Guild awards. Since her career progressed in the 1990s, she has become one of the world's highest-paid actresses.\n\nThe daughter of actors John Aniston and Nancy Dow, she began working as an actress at an early age with an uncredited role in the 1988 film Mac and Me; her first major film role came in the 1993 horror comedy Leprechaun. She has since starred in a string of successful comedy films such as Office Space (1999), Bruce Almighty (2003), The Break-Up (2006), Marley & Me (2008), Just Go with It (2011), Horrible Bosses (2011), We're the Millers (2013), Dumplin' (2018), Murder Mystery (2019) and its sequel Murder Mystery 2 (2023). Aniston also starred in the acclaimed independent films The Good Girl (2002), Friends with Money (2006), and Cake (2014). She returned to television in 2019, producing and starring in the Apple TV+ drama series The Morning Show, for which she received a Screen Actors Guild Award.\n\nAniston has been included in numerous magazines' lists of the world's most beautiful women. Her net worth is estimated as $300 million, and her box office gross is over $1.6 billion worldwide. She is the recipient of a star on the Hollywood Walk of Fame and is the co-founder of the production company Echo Films, established in 2008. She has been married twice: first to actor Brad Pitt, to whom she was married for five years, and later to actor Justin Theroux, whom she married in 2015 and separated from in 2017.",
  "also_known_as": [
    "詹妮弗·安妮斯顿",
    "Jennifer Joanna Aniston",
    "Jennifer Aniston Arquette",
    "珍妮佛·安妮斯頓"
  ],
  "birthday": "1969-02-11",
  "deathday": null,
  "popularity": 27.923,
  "homepage": null,
  "imdb_id": "nm0000098",
  "known_for_department": "Acting",
  "place_of_birth": "Sherman Oaks, Los Angeles, California, USA",
  "gender": 1,
  "profile_path": "/qPXG41rYdUGldZhMhuZFvmpZKRp.jpg"
},
{
  "_id": 116691,
  "adult": false,
  "name": "Marcia DeBonis",
  "biography": "",
  "also_known_as": [
    "Marcia Bebonis",
    "Marcia De Bonis",
    "Marcia Debonis"
  ],
  "birthday": "1960-06-04",
  "deathday": null,
  "popularity": 7.508,
  "homepage": null,
  "imdb_id": "nm0213482",
  "known_for_department": "Acting",
  "place_of_birth": "USA",
  "gender": 1,
  "profile_path": "/eZe5MaHdSP4YFNqKznG1eWYVBGc.jpg"
},
{
  "_id": 1333,
  "adult": false,
  "name": "Andy Serkis",
  "biography": "Andrew Clement Serkis (born 20 April 1964) is an English actor, director and producer of Iraqi and Armenian descent. He is best known for his performance capture roles comprising motion capture acting, animation, and voice work for computer-generated characters such as Gollum in The Lord of the Rings film trilogy (2001–2003) and The Hobbit: An Unexpected Journey (2012), King Kong in the eponymous 2005 film, Caesar in the Planet of the Apes reboot series (2011–2017), Captain Haddock / Sir Francis Haddock in Steven Spielberg's The Adventures of Tintin (2011), and Supreme Leader Snoke in the Star Wars sequel trilogy films The Force Awakens (2015) and The Last Jedi (2017). In 2018, he portrayed the character of Baloo in his self-directed film, Mowgli: Legend of the Jungle.\n\nSerkis is one of the highest-grossing actors of all time, number ten, and his film work in motion capture has been critically acclaimed. He has received an Empire Award and two Saturn Awards for his motion-capture acting. He earned a Golden Globe nomination for his portrayal of serial killer Ian Brady in the British television film Longford (2006) and was nominated for a BAFTA for his portrayal of new wave and punk rock musician Ian Dury in the biopic Sex & Drugs & Rock & Roll (2010). In 2020, Serkis received the BAFTA Award for Outstanding British Contribution To Cinema. In 2021, he won a Daytime Emmy Award for the series The Letter for the King (2020).\n\nSerkis portrayed Ulysses Klaue in the Marvel Cinematic Universe films Avengers: Age of Ultron (2015) and Black Panther (2018). He also played Alfred Pennyworth in The Batman (2022). Serkis has his own production company and motion capture workshop, The Imaginarium in London, which he used for Mowgli: Legend of the Jungle. He made his directorial debut with Imaginarium's 2017 film Breathe. He directed Venom: Let There Be Carnage (2021), which is set in Sony's Spider-Man Universe.",
  "also_known_as": [
    "أندي سركيس",
    "앤디 서키스",
    "アンディ・サーキス",
    "安迪·瑟克斯"
  ],
  "birthday": "1964-04-20",
  "deathday": null,
  "popularity": 26.669,
  "homepage": "http://www.serkis.com/",
  "imdb_id": "nm0785227",
  "known_for_department": "Acting",
  "place_of_birth": "Ruislip, Middlesex, England, UK",
  "gender": 2,
  "profile_path": "/eNGqhebQ4cDssjVeNFrKtUvweV5.jpg"
},
{
  "_id": 78030,
  "adult": false,
  "name": "Ashley Benson",
  "biography": "Ashley Victoria Benson was born on December 18, 1989. She has been dancing competitively since she was 2 with hip hop, jazz, ballet, tap and lyrical. She has been singing since she was about 5 and she hopes to pursue that along with her acting. Ashley started modeling at the age of 5 for dance catalogs. Ashley was then pursued by The Ford Modeling Agency at the age of 8. She worked steadily in print and is still with the Agency. At the age of 10, she wanted to pursue acting. Ashley went on to do 35 commercials, and then on to theatrical roles. Acting was now Ashley's passion. Ashley put all her focus into acting which left little time for modeling and dancing, anymore. Ashley's most recent role is \"Abby Deveraux\" on the hit soap \"Days of Our Lives\" (1965). Ashley also had a cameo in 'Lil Romeo' and Solange Knowles's music video for the song \"True Love\". She did a photo shoot with Britney Spears for Vogue Magazine. She is in NLT's music video \"That Girl\".",
  "also_known_as": [
    "Ashley Victoria Benson",
    "アシュレイ・ベンソン",
    "アシュレイ・ヴィクトリア・ベンソン "
  ],
  "birthday": "1989-12-18",
  "deathday": null,
  "popularity": 14.144,
  "homepage": "https://ashleybenson.org/",
  "imdb_id": "nm1667364",
  "known_for_department": "Acting",
  "place_of_birth": "Long Beach, California, USA",
  "gender": 1,
  "profile_path": "/3kPXGhqo9fQro0rifqPFvwt4cuo.jpg"
},
{
  "_id": 60073,
  "adult": false,
  "name": "Brie Larson",
  "biography": "Brie Larson (born Brianne Sidonie Desaulniers; October 1, 1989), is an American actress and filmmaker. She's best known for her role as Carol Danvers / Captain Marvel in Captain Marvel (2019) and reprise her role in other MCU films and series. She's also known for her roles as Elizabeth Zott in the miniseries Lessons in Chemistry (which she also executive produced), Tess in Fast X, Eva Ansley in Just Mercy, Jeannette Walls in The Glass Castle, Mason Weaver in Kong: Skull Island, Joy \"Ma\" Newsome in Room, Kim Townsend in Trainwreck, Amy Phillips in The Gambler, Monica Martello in Don Jon, Cassidy Roy in The Spectacular Now, Molly Tracey in 21 Jump Street, Helen in Rampart, Envy Adams in Scott Pilgrim vs. the World, Kate Gregson on Showtime's United States of Tara, Beatrice \"The Bear\" Leep in Hoot, and Emily Stewart on WB's sitcom Raising Dad.\n\nShe appeared as a regular in the 2001 sitcom Raising Dad and briefly dabbled with a music career, releasing the album Finally Out of P.E. in 2005. She played supporting roles in the comedy films 13 Going on 30 (2004), Hoot (2006), Scott Pilgrim vs. the World (2010), and 21 Jump Street (2012), and appeared as a sardonic teenager in the television series United States of Tara (2009–2011).\n\nHer breakthrough came with a leading role in the acclaimed independent drama Short Term 12 (2013), and she continued to take on supporting parts in the romance The Spectacular Now (2013) and the comedy Trainwreck (2015). For playing a kidnapping victim in the drama Room (2015), she won the Academy Award for Best Actress.\n\nThe 2017 adventure film Kong: Skull Island marked her first big-budget release, followed by Free Fire, The Glass Castle, Unicorn Store, and Basmati Blues, the same year. She then starred as Carol Danvers / Captain Marvel in the 2019 Marvel Cinematic Universe superhero film Captain Marvel. She reprised her role in other MCU films including Avengers: Endgame, Shang-Chi and the Legend of the Ten Rings, Avengers: Quantum Encounter, and The Marvels, as well as in the series Ms. Marvel. She then starred in and executive produced the comedy-drama Apple TV+ miniseries Lessons in Chemistry (2023). She also starred in Fast X (2023).\n\nShe has co-written and co-directed two short films, and made her feature film directorial debut with the independent comedy-drama Unicorn Store (2017). For producing the virtual reality series The Messy Truth VR Experience (2020), she won a Primetime Emmy Award.",
  "also_known_as": [
    "Brianne Sidonie Desaulniers",
    "بري لارسون",
    "브리 라슨",
    "ブリー・ラーソン",
    "Бри Ларсон",
    "บรี ลาร์สัน",
    "布丽·拉尔森",
    "Брі Ларсон",
    " ब्री लार्सन",
    "Μπρι Λάρσον",
    "ברי לארסון",
    "貝兒娜森",
    "بری لارسون",
    "布麗·拉森"
  ],
  "birthday": "1989-10-01",
  "deathday": null,
  "popularity": 21.61,
  "homepage": null,
  "imdb_id": "nm0488953",
  "known_for_department": "Acting",
  "place_of_birth": "Sacramento, California, USA",
  "gender": 1,
  "profile_path": "/iqZ5uKJWbwSITCK4CqdlUHZTnXD.jpg"
},
{
  "_id": 71403,
  "adult": false,
  "name": "Rob Riggle",
  "biography": "Robert A. Riggle Jr. (born April 21, 1970) is an American comedian, actor and retired United States Marine Corps Reserve Lieutenant Colonel. Riggle has amassed many notable television credits and has also earned roles in several feature films, including Le Lorax (2012) and 21 Jump Street (2012). After graduating from the University of Kansas with a B.A. in Theater and Film, Riggle joined the Marines and earned a Master's degree from Webster University in Public Administration. A featured cast member onSaturday Night Live (1975) during the 2004/2005 season, Riggle then joined Comedy Central's The Daily Show (1996) in 2006 as a correspondent. Riggle's numerous television appearances, including credits on Chappelle's Show (2003), 30 Rock (2006) and The Office (2005) would lead to big-screen roles in FVery Bad Trip (2009) and Very Bad Cops (2010). When he is not on set or traveling across the United States performing stand-up comedy, Rob Riggle lives in Los Angeles.",
  "also_known_as": [
    "Robert Allen Riggle Jr.",
    "Ρομπ Ρίγκλ"
  ],
  "birthday": "1970-04-21",
  "deathday": null,
  "popularity": 9.075,
  "homepage": null,
  "imdb_id": "nm1443527",
  "known_for_department": "Acting",
  "place_of_birth": "Louisville, Kentucky, USA",
  "gender": 2,
  "profile_path": "/hQgOp8vWxl6KPZbqzKSSL4k6G1j.jpg"
},
{
  "_id": 1289968,
  "adult": false,
  "name": "Cara Delevingne",
  "biography": "Cara Jocelyn Delevingne (born 12 August 1992) is an English model, actress, and singer. She signed with Storm Management after leaving school in 2009. Delevingne won Model of the Year at the British Fashion Awards in 2012 and 2014.\n\nDelevingne started her acting career with a minor role in the 2012 film adaptation of Anna Karenina by Joe Wright. Her most notable roles include Margo Roth Spiegelman in the romantic mystery film Paper Towns (2015), the Enchantress in the comic book film Suicide Squad (2016), and Laureline in Luc Besson's Valerian and the City of a Thousand Planets (2017).",
  "also_known_as": [
    "卡拉·迪瓦伊",
    "카라 델레바인",
    "Кара Делевінь",
    "Cara Jocelyn Delevingne",
    "Κάρα Τζόσελιν Ντελεβίν",
    "Κάρα Ντελεβίν",
    "卡拉‧迪樂芬妮"
  ],
  "birthday": "1992-08-12",
  "deathday": null,
  "popularity": 17.634,
  "homepage": null,
  "imdb_id": "nm5353321",
  "known_for_department": "Acting",
  "place_of_birth": "Hammersmith, London, England, UK",
  "gender": 1,
  "profile_path": "/lEIFRIR8EohwOVe7PQu4zvIl850.jpg"
},
{
  "_id": 21007,
  "adult": false,
  "name": "Jonah Hill",
  "biography": "Jonah Hill Feldstein (born December 20, 1983) is an American actor, comedian, screenwriter, producer and director. He is known for his comedic roles in films including Superbad (2007), Knocked Up (2007), 21 Jump Street (2012), This Is the End (2013), and 22 Jump Street (2014). For his performances in Moneyball (2011) and The Wolf of Wall Street (2013), he was nominated for the Academy Award for Best Supporting Actor.\n\nHill ranked 28th on Forbes magazine's list of highest-paid actors from June 2014 to June 2015, at $16 million. In 2020, he was found to have sworn on film more than any other actor. As a screenwriter, he contributed to the stories of 21 Jump Street, 22 Jump Street, Sausage Party and Why Him? In 2018, he starred in the Netflix dark comedy miniseries Maniac and made his directorial debut with the film Mid90s. He also wrote the screenplay for Mid90s.\n\nHill has provided voices for the animated films Horton Hears a Who! (2008), Megamind (2010), How to Train Your Dragon (2010–2019), The Lego Movie (2014), and The Lego Movie 2: The Second Part (2019).",
  "also_known_as": [
    "조나 힐",
    "Jonah Hill Feldstein",
    "Τζόνα Χιλ",
    "Джона Гілл",
    "Джона Хилл",
    "喬納·希爾"
  ],
  "birthday": "1983-12-20",
  "deathday": null,
  "popularity": 19.467,
  "homepage": null,
  "imdb_id": "nm1706767",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 2,
  "profile_path": "/cymlWttB83MsAGR2EkTgANtjeRH.jpg"
},
{
  "_id": 6106,
  "adult": false,
  "name": "Steven Weber",
  "biography": "Steven Robert Weber is an American actor and comedian. He is best known for his role as Brian Hackett on the television series Wings, voicing Charlie B. Barkin in All Dogs Go to Heaven: The Series, and portraying Jack Torrance in the TV miniseries adaptation of Stephen King's The Shining.\n\nWeber was born on March 4, 1961, in Briarwood, Queens, New York. He is the son of Fran (Frankel), a nightclub singer, and Stuart Weber, a nightclub performer, and Borscht Belt comic and manager. He began his acting career in high school, appearing in several productions. After graduating from high school, he attended the High School of the Performing Arts in New York City and graduated from New York State University at Purchase.\n\nWeber's first major acting role was in the 1987 film Hamburger Hill. He then went on to appear in a number of other films, including The Flamingo Kid (1984), The Kennedys of Massachusetts (1990), and The Shining (1997).\n\nIn 1990, Weber began starring as Brian Hackett on the television series Wings. The show ran for eight seasons and was a critical and commercial success. Weber's performance on the show earned him a Golden Globe nomination for Best Actor – Television Series Musical or Comedy.\n\nIn 1994, Weber began voicing Charlie B. Barkin in the animated series All Dogs Go to Heaven: The Series. He continued to voice the character until the show ended in 1996.\n\nIn 1997, Weber starred in the TV miniseries adaptation of Stephen King's The Shining. He played Jack Torrance, the role made famous by Jack Nicholson in the 1980 film. Weber's performance was praised by critics, and he was nominated for a Golden Globe Award for Best Actor – Miniseries or Television Film.\n\nWeber has continued to work in film and television since then. He has appeared in a number of films, including The Santa Clause 2 (2002), The Santa Clause 3: The Escape Clause (2006), and The Christmas Chronicles (2018). He has also appeared in a number of television shows, including iZombie, NCIS: New Orleans, and Chicago Med.",
  "also_known_as": [
    "Steven R. Weber"
  ],
  "birthday": "1961-03-04",
  "deathday": null,
  "popularity": 14.95,
  "homepage": null,
  "imdb_id": "nm0001836",
  "known_for_department": "Acting",
  "place_of_birth": "Briarwood, Queens, New York, USA",
  "gender": 2,
  "profile_path": "/8FtkapenCOpe39eE1sQus5WLWAq.jpg"
},
{
  "_id": 965819,
  "adult": false,
  "name": "Finley Jacobsen",
  "biography": "Finley Jacobsen is an actor, known for Olympus Has Fallen (2013), Marmaduke (2010) and Marley & Me (2008).",
  "also_known_as": [
    "핀리 제이콥슨"
  ],
  "birthday": "2002-10-03",
  "deathday": null,
  "popularity": 5.622,
  "homepage": null,
  "imdb_id": "nm3124890",
  "known_for_department": "Acting",
  "place_of_birth": "  United States",
  "gender": 2,
  "profile_path": "/jb5V4NPK0rSxQ7KH6PxftVhQLW8.jpg"
},
{
  "_id": 28472,
  "adult": false,
  "name": "Adam Garcia",
  "biography": "​From Wikipedia, the free encyclopedia\n\nAdam Garcia (born Adam Gabriel Garcia, 1 June 1973, Wahroonga, New South Wales, Australia) is an Australian actor and tap dancer of partial Colombian descent (his father is from Colombia).",
  "also_known_as": [
    "Adam Gabriel Garcia ",
    "아담 가르시아"
  ],
  "birthday": "1973-06-01",
  "deathday": null,
  "popularity": 19.393,
  "homepage": null,
  "imdb_id": "nm0305081",
  "known_for_department": "Acting",
  "place_of_birth": "Wahroonga, New South Wales, Australia",
  "gender": 2,
  "profile_path": "/kPw3QKgO56JgWx1JPnwlCxDE7wz.jpg"
},
{
  "_id": 67599,
  "adult": false,
  "name": "Vanessa Hudgens",
  "biography": "Vanessa Anne Hudgens (born December 14, 1988) is an American actress and singer. After making her feature film debut in Thirteen (2003), Hudgens rose to fame portraying Gabriella Montez in the High School Musical film series (2006–2008), which brought her significant mainstream media success. The success of the first film led Hudgens to acquire a recording contract with Hollywood Records, with whom she released two studio albums, V (2006) and Identified (2008).\n\nSince the release of her studio albums and the High School Musical franchise, Hudgens has focused on her acting career. She appeared in the films Bandslam (2009), Beastly, Sucker Punch (both 2011), Journey 2: The Mysterious Island, Spring Breakers (both 2012), Second Act (2018), Bad Boys for Life (2020), and Tick, Tick...Boom! (2021). She starred in the Netflix Christmas movies The Princess Switch (2018) and its sequels (2020 and 2021) and The Knight Before Christmas (2019), and co-produced the latter three.\n\nHudgens played the role of Emily Locke in the NBC series Powerless (2017). She also played the title role in the Broadway musical Gigi (2015) and had roles in two of Fox's live musical productions: Rizzo in Grease: Live (2016) and Maureen Johnson in Rent: Live (2019). In 2022, Hudgens co-hosted the Met Gala in Manhattan.",
  "also_known_as": [
    "바네사 허진스",
    "Vanessa Anne Hudgens",
    "Βανέσα Αν Χάντζενς",
    "Βανέσα Χάντζενς",
    "ヴァネッサ・ハジェンズ",
    "ヴァネッサ・アン・ハジェンズ"
  ],
  "birthday": "1988-12-14",
  "deathday": null,
  "popularity": 33.27,
  "homepage": null,
  "imdb_id": "nm1227814",
  "known_for_department": "Acting",
  "place_of_birth": "Salinas, California, USA",
  "gender": 1,
  "profile_path": "/ssFXWN5li5OWJLgUoFlUDY0ZyPc.jpg"
},
{
  "_id": 8944,
  "adult": false,
  "name": "Jamie Lee Curtis",
  "biography": "Jamie Lee Curtis (born November 22, 1958) is an American actress, producer, and children's author. Known for her performances in the horror and slasher genres, she is regarded as a scream queen, in addition to roles in comedies. She has received multiple accolades, including an Academy Award, a BAFTA, two Golden Globes, and two Screen Actors Guild Awards, as well as nominations for an Emmy and a Grammy.\n\nShe came to prominence with the ABC sitcom Operation Petticoat (1977–1978). She made her feature film debut playing Laurie Strode in John Carpenter's slasher film Halloween (1978), which established her as a scream queen and led to a string of parts in horror films such as The Fog, Prom Night, Terror Train (all 1980), and Roadgames (1981). She reprised the role of Laurie in the Halloween franchise, until 2022.\n\nHer film work spans many genres outside of horror, including the comedies Trading Places (1983), for which she won a BAFTA for Best Supporting Actress, and A Fish Called Wanda (1988), for which she received a nomination for the BAFTA for Best Actress. Her role as a workout instructor in the film Perfect (1985) earned her a reputation as a sex symbol. She won a Golden Globe Award for her portrayal of Helen Tasker in James Cameron's True Lies (1994). Her other notable film credits include Freaky Friday (2003) and Knives Out (2019). Her performance in Everything Everywhere All at Once (2022) won her the Academy Award for Best Supporting Actress. She received a star on the Hollywood Walk of Fame in 1998. As of 2021, her films have grossed over $2.3 billion at the box office.\n\nShe received a Golden Globe and a People's Choice Award for her portrayal of Hannah Miller on ABC's Anything But Love (1989–1992), and earned a Primetime Emmy nomination for the television film Nicholas' Gift (1998). She also starred as Cathy Munsch on the Fox series Scream Queens (2015–16), for which she received her seventh Golden Globe nomination.\n\nShe has written numerous children's books, including Today I Feel Silly, and Other Moods That Make My Day (1998), which made The New York Times's best-seller list.\n\nShe is a daughter of actors Janet Leigh and Tony Curtis. She is married to British-American filmmaker Christopher Guest, with whom she has two adopted children. Her marriage to Guest, who holds the British title of 5th Baron Haden-Guest, makes her a baroness who is entitled to use the name \"The Right Honourable The Lady Haden-Guest\", though she opts not to use it.",
  "also_known_as": [
    "Scream Queen",
    "제이미 리 커티스",
    "Джеймі Лі Кертіс",
    "ג'יימי לי קרטיס"
  ],
  "birthday": "1958-11-22",
  "deathday": null,
  "popularity": 36.339,
  "homepage": null,
  "imdb_id": "nm0000130",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 1,
  "profile_path": "/9KWvPVeiLOXlOGl0XVyHZtJWQtx.jpg"
},
{
  "_id": 55775,
  "adult": false,
  "name": "Katie Cassidy",
  "biography": "Katherine Evelyn Anita \"Katie\" Cassidy (born November 25, 1986) is an American actress who has performed in The CW TV series Melrose Place, Supernatural, and Gossip Girl, and is considered to be a modern-day Scream queen for her roles in When a Stranger Calls, Black Christmas, A Nightmare on Elm Street and the horror TV series, Harper's Island. Cassidy also starred in Taken, and has roles in the upcoming films Fencewalker and Monte Carlo.\n\n​From Wikipedia, the free encyclopedia",
  "also_known_as": [
    "Katie Cassidy Rodgers",
    "Katherine Evelyn Anita Cassidy"
  ],
  "birthday": "1986-11-25",
  "deathday": null,
  "popularity": 42.313,
  "homepage": null,
  "imdb_id": "nm1556320",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 1,
  "profile_path": "/v7cs7RFcfoiL8W1YRkZK5lBc57H.jpg"
},
{
  "_id": 3391,
  "adult": false,
  "name": "Kathleen Turner",
  "biography": "Mary Kathleen Turner (born June 19, 1954) is an American actress. She has received various accolades, including two Golden Globe Awards, in addition to nominations for an Academy Award, a Grammy Award, and two Tony Awards.\n\nTurner became widely known during the 1980s, with roles in Body Heat (1981), The Man with Two Brains (1983), Crimes of Passion (1984), Romancing the Stone (1984), and Prizzi's Honor (1985), the latter two earning her a Golden Globe Award for Best Actress – Motion Picture Musical or Comedy, and Peggy Sue Got Married (1986), for which she was nominated for the Academy Award for Best Actress. In the later 1980s and early 1990s, Turner had roles in The Accidental Tourist (1988), The War of the Roses (1989), and Serial Mom (1994).\n\nShe later had roles in The Virgin Suicides (1999), Baby Geniuses (1999), Beautiful (2000), and Marley & Me (2008). On TV she guest-starred on the NBC sitcom Friends as Chandler Bing's drag queen father Charles Bing, in the third season of Showtime's Californication as Sue Collini, the jaded, sex-crazed owner of a talent agency, and on the Netflix dramedy series The Kominsky Method as Michael Douglas's character's ex-wife Roz Volander. Turner's voice roles include Jessica Rabbit in Who Framed Roger Rabbit (1988), Monster House (2006), and voicing characters on the television series The Simpsons, Family Guy, King of the Hill, and Rick and Morty.\n\nIn addition to film, Turner has worked in the theater, and has been nominated for the Tony Award twice for her Broadway roles as Maggie in Cat on a Hot Tin Roof and as Martha in Who's Afraid of Virginia Woolf? Turner has also taught acting classes at New York University.\n\nDescription above from the Wikipedia article Kathleen Turner, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "캐서린 터너",
    "קתלין טרנר",
    "מרי קת'לין טרנר"
  ],
  "birthday": "1954-06-19",
  "deathday": null,
  "popularity": 29.763,
  "homepage": "https://kathleenturner.net/",
  "imdb_id": "nm0000678",
  "known_for_department": "Acting",
  "place_of_birth": "Springfield, Missouri, USA",
  "gender": 1,
  "profile_path": "/sLfWEslOaQsA2g3ocQybkwJKgz9.jpg"
},
{
  "_id": 18052,
  "adult": false,
  "name": "Nathan Gamble",
  "biography": "From Wikipedia, the free encyclopedia.\n\nNathan Gamble (born January 12, 1998) is an American child actor who made his feature film debut in Babel (2006), for which he was nominated for a 2007 Young Artist Award.\n\nGamble was born in Tacoma, Washington, the son of theater directors who run a drama camp for children. His additional screen credits include Dry Rain (2007), Saving Sam (2007), Diggers (2007), The Mist (2007), The Dark Knight (2008), and Marley & Me (2008).\n\nOn television, Gamble appeared in Runaway in 2006; crossover episodes of CSI: Crime Scene Investigation and Without a Trace in 2007; and House and Ghost Whisperer in 2008. In 2009 he played the role of Henry Pryor, son of the title character in Hank. In 2010 he played the role of Daniel in a short film called Displaced, the film was commissioned by the City of Seattle as part of the Water Calling series and aired at Seattle Channel.\n\nGamble has completed filming the role of Poe Malloy in Captain Cook's Extraordinary Atlas for Warner Bros. Television. He portrayed Lucas Thompson in the film The Hole, which was released in 2010.\n\nDescription above from the Wikipedia article Nathan Gamble, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "나단 겜블"
  ],
  "birthday": "1998-01-12",
  "deathday": null,
  "popularity": 14.071,
  "homepage": null,
  "imdb_id": "nm1997480",
  "known_for_department": "Acting",
  "place_of_birth": "Tacoma, Washington, USA",
  "gender": 2,
  "profile_path": "/utbynIWozMtWsRZH9nt1BE2ae5P.jpg"
},
{
  "_id": 19292,
  "adult": false,
  "name": "Adam Sandler",
  "biography": "Adam Richard Sandler (born September 9, 1966) is an American comedian, actor, and filmmaker. He was a cast member on Saturday Night Live from 1990 to 1995, before going on to star in many Hollywood films, which have combined to earn more than $2 billion at the box office. Sandler had an estimated net worth of $420 million in 2020, and signed a further four-movie deal with Netflix worth over $250 million.\n\nSandler's comedic roles include Billy Madison (1995), Happy Gilmore (1996), The Waterboy (1998), The Wedding Singer (1998), Big Daddy (1999), Mr. Deeds (2002), 50 First Dates (2004), The Longest Yard (2005), Click (2006), Grown Ups (2010), Just Go with It (2011), Grown Ups 2 (2013), Blended (2014), Murder Mystery (2019) and Hubie Halloween (2020). He also voiced Davey, Whitey, and Eleanore in Eight Crazy Nights and Dracula in the first three films of the Hotel Transylvania franchise (2012–2018).\n\nWhile some of his comedic films, including Jack and Jill (2011), have been panned, resulting in Sandler receiving nine Golden Raspberry Awards and 37 Raspberry Award nominations, more than any actor other than Sylvester Stallone, he has received critical acclaim for his dramatic performances in the dramedy films Spanglish (2004), Reign Over Me (2007), and Funny People (2009). He has also been roundly praised for his leading roles in auteur films including Punch-Drunk Love (2002) by Paul Thomas Anderson, Noah Baumbach's The Meyerowitz Stories (2017), and the Safdie brothers' Uncut Gems (2019), the last of which earned him the Independent Spirit Award for Best Male Lead.",
  "also_known_as": [
    "亞當·山德勒"
  ],
  "birthday": "1966-09-09",
  "deathday": null,
  "popularity": 43.602,
  "homepage": "http://www.adamsandler.com/",
  "imdb_id": "nm0001191",
  "known_for_department": "Acting",
  "place_of_birth": "Brooklyn, New York, USA",
  "gender": 2,
  "profile_path": "/dFgy0kGwjKzTYxEntxzM4EN1Wm8.jpg"
},
{
  "_id": 28238,
  "adult": false,
  "name": "David Hasselhoff",
  "biography": "David Michael Hasselhoff  (born July 17, 1952), nicknamed \"The Hoff,\" is an American actor, singer, producer and businessman. He is best-known for his lead roles as Michael Knight in the popular 1980s US series Knight Rider and as L.A. County Lifeguard Mitch Buchannon in the series Baywatch. Hasselhoff also produced Baywatch for a number of seasons in the 1990s up until 2001, when the series ended with Baywatch Hawaii. Hasselhoff also crossed over to a music career during the end of the 1980s and the early 1990s. He was noted for his performance at the Berlin Wall at New Year's Eve 1989; he enjoyed a short lived success as a singer primarily in German-speaking Europe. More recently, Hasselhoff has been involved with talent shows such as NBC's America's Got Talent from 2006–2009. Hasselhoff was the first celebrity eliminated from the eleventh season of Dancing with the Stars, on September 21, 2010. Hasselhoff left the America's Got Talent judging panel after the 2009 season, but later joined the Britain's Got Talent judging panel, alongside Amanda Holden and Michael McIntyre in 2011. He appeared as himself in the live action/CGI-animated film \"Hop\" in 2011.\n\nDescription above from the Wikipedia article David Hasselhoff, licensed under CC-BY-SA, full list of contributors on Wikipedia",
  "also_known_as": [
    "Дэвид Майкл Хассельхофф",
    "Дэвид Хассельхофф",
    "Ντέιβιντ Χέισελχοφ",
    "Ντέιβιντ Μάικλ Χέισελχοφ"
  ],
  "birthday": "1952-07-17",
  "deathday": null,
  "popularity": 31.231,
  "homepage": "http://davidhasselhoffonline.com/",
  "imdb_id": "nm0001327",
  "known_for_department": "Acting",
  "place_of_birth": "Baltimore, Maryland, USA",
  "gender": 2,
  "profile_path": "/rciClqd1L98uHe24Rr5RoY1KNhG.jpg"
},
{
  "_id": 1903,
  "adult": false,
  "name": "Alan Arkin",
  "biography": "Alan Wolf Arkin (March 26, 1934 – June 29, 2023) was an American actor, director, musician and singer. He was known for starring in such films as Wait Until Dark, The Russians Are Coming, the Russians Are Coming, Minions: The Rise of Gru, The Heart Is a Lonely Hunter, Catch-22, The In-Laws, Edward Scissorhands, Glengarry Glen Ross, Marley & Me, Argo and Little Miss Sunshine, for which he won an Academy Award for Best Supporting Actor in 2006. He was the father of actors Adam Arkin, Anthony Arkin, and Matthew Arkin.",
  "also_known_as": [
    "Alan Wolf Arkin",
    "艾伦·阿金",
    "Алан Аркин",
    "알란 아킨",
    "אלן וולף ארקין "
  ],
  "birthday": "1934-03-26",
  "deathday": "2023-06-29",
  "popularity": 48.901,
  "homepage": null,
  "imdb_id": "nm0000273",
  "known_for_department": "Acting",
  "place_of_birth": "New York City, New York, USA",
  "gender": 2,
  "profile_path": "/lTMMpkqL0G3WeFNfbtdP5COZEiX.jpg"
},
{
  "_id": 1907,
  "adult": false,
  "name": "Kathy Baker",
  "biography": "Kathy Baker is an American stage, film and television actress.",
  "also_known_as": [
    "Katherine Whitton Baker",
    "Katherine Baker"
  ],
  "birthday": "1950-06-08",
  "deathday": null,
  "popularity": 29.289,
  "homepage": null,
  "imdb_id": "nm0000834",
  "known_for_department": "Acting",
  "place_of_birth": "Midland, Texas, USA",
  "gender": 1,
  "profile_path": "/c5MAs0tvUg9pdxbayxRAFLm0Qz5.jpg"
},
{
  "_id": 38673,
  "adult": false,
  "name": "Channing Tatum",
  "biography": "Channing Matthew Tatum (born April 26, 1980) is an American actor. Tatum made his film debut in the drama Coach Carter (2005), and had his breakthrough role in the 2006 dance film Step Up. He gained wider attention for his leading roles in the sports comedy She's the Man (2006), the comedy-drama Magic Mike (2012) and its sequels Magic Mike XXL (2015) and Magic Mike's Last Dance (2023), the latter two of which he also produced, and in the action-comedy 21 Jump Street (2012) and its sequel 22 Jump Street (2014).\n\nTatum has also appeared as Duke in the action film G.I. Joe: The Rise of Cobra (2009) and its sequel G.I. Joe: Retaliation (2013). His other films include White House Down (2013), Foxcatcher (2014), The Hateful Eight (2015), Hail, Caesar! (2016), Logan Lucky (2017), and The Lost City (2022). Tatum has also starred in, produced and co-directed the road film Dog (2022). Time magazine named him one of the 100 most influential people in the world in 2022.",
  "also_known_as": [
    "채닝 테이텀",
    "تشانينج تيتوم",
    "チャニング・テイタム",
    "แชนนิง เททัม",
    "查尼·泰坦",
    "Ченнінг Татум",
    "Ченнінг Тейтум",
    "Ченнинг Тейтум",
    "Τσάνινγκ Τέιτουμ",
    "צ'נינג מת'יו טייטום",
    "Ченнінґ Татум"
  ],
  "birthday": "1980-04-26",
  "deathday": null,
  "popularity": 107.308,
  "homepage": null,
  "imdb_id": "nm1475594",
  "known_for_department": "Acting",
  "place_of_birth": "Cullman, Alabama, USA",
  "gender": 2,
  "profile_path": "/xdnstENLdWMPWt9qyhtf695L4t6.jpg"
},
{
  "_id": 118545,
  "adult": false,
  "name": "Dakota Johnson",
  "biography": "Dakota Mayi Johnson (born October 4, 1989) is an American actress. The daughter of actors Don Johnson and Melanie Griffith, she made her film debut at age ten with a minor role in the dark comedy film Crazy in Alabama (1999) with her mother. After graduating high school, she began auditioning for roles in Los Angeles and was cast in a minor part in The Social Network (2010). Johnson had her breakthrough playing Anastasia Steele in the erotic romantic drama film series Fifty Shades (2015–2018), and received a BAFTA Rising Star Award nomination in 2016.\n\nJohnson appeared in films such as the crime drama Black Mass (2015), Luca Guadagnino's drama A Bigger Splash (2015), the romantic comedy How to Be Single (2016), the supernatural horror film Suspiria (2018), the thriller Bad Times at the El Royale (2018), the coming-of-age film The Peanut Butter Falcon (2019), Maggie Gyllenhaal's psychological drama The Lost Daughter (2021), and Cooper Raiff's Cha Cha Real Smooth (2022).\n\nShe has received various awards and nominations, including a People's Choice Award, and nominations for a BAFTA Award and two MTV Movie & TV Awards. She was also featured in Forbes 30 Under 30 list in 2016.",
  "also_known_as": [
    "Ντακότα Τζόνσον",
    "다코타 존슨",
    "达科塔·约翰逊",
    "דקוטה ג'ונסון",
    "Dakota Mayi Johnson",
    "達珂塔·強生"
  ],
  "birthday": "1989-10-04",
  "deathday": null,
  "popularity": 111.968,
  "homepage": null,
  "imdb_id": "nm0424848",
  "known_for_department": "Acting",
  "place_of_birth": "Austin, Texas, USA",
  "gender": 1,
  "profile_path": "/rtxJfCCLdp1oi7bQ1ENVZRRkrJ5.jpg"
},
{
  "_id": 9779,
  "adult": false,
  "name": "Morris Chestnut",
  "biography": "Morris Lamont Chestnut is an American film and television actor. He is known for his roles as teenage father Ricky Baker in the 1991 film Boyz n the Hood, groom-to-be Lance Sullivan in the 1999 film The Best Man, as NBA star Tracy Reynolds in the 2002 film Like Mike, and as the Visitor Ryan Nichols in the TV series V (2009).\n\nHis first professional acting role was as Jadon in Freddy's Nightmares: A Nightmare on Elm Street: The Series in the episode \"A Family Affair\" (season 2, episode 19) which aired on February 18, 1990.\n\nHis first feature film role was as Ricky Baker in Boyz n the Hood (1991). He followed with roles in various TV movies. Chestnut also played a role on Patti LaBelle's short-lived sitcom Out All Night. His career continued to rise steadily with co-starring roles in standard big-budget studio films like Under Siege 2 (1995) and G.I. Jane (1997). In 1998, he won the annual Madden Bowl video game competition.\n\nIn 1999, he starred in The Best Man with Taye Diggs and Nia Long in which he played a professional football player on the eve of his wedding. He reprised his role in Best Man Holiday. For both of his performances, he earned NAACP Image Award nominations. He then starred in The Brothers (2001), another film centering on the themes of fidelity and success among urban professionals.  He has worked with Steven Seagal three times in Under Siege 2: Dark Territory, Half Past Dead and Prince of Pistols.\n\nHe starred In Two Can Play That Game (2001), Breakin' All the Rules (2004), and Ladder 49 (2004). He again played a football player in The Game Plan (2007). He produced and starred in the film Not Easily Broken (2009). He starred as Ryan Nichols in the TV series reboot of V (2009). He then appeared in the films Think Like a Man (2012), and, in 2013, the films Identity Thief, Kick-Ass 2, and The Call.\n\nIn 2013, he joined the cast of HBO's Nurse Jackie, playing war veteran Dr. Ike Prentiss. The following year, he won the NAACP Image Award for Outstanding Supporting Actor in a Comedy Series. In 2015, Morris Chestnut played Derrick Dog Prince in the movie Heist; and People magazine named him as one of the \"Sexiest Men Alive\" in 2015. He then starred in the films The Perfect Guy (2016) and When the Bough Breaks (2017).\n\nHe played the lead role of pathologist Dr. Beaumont Rosewood Jr. in the series Rosewood, receiving another NAACP image Award nomination. He had recurring roles in the TV series Legends, The Enemy Within, and Our Kind of People. He had a starring guest role on the medical drama The Resident.",
  "also_known_as": [
    "Моррис Честнат"
  ],
  "birthday": "1969-01-01",
  "deathday": null,
  "popularity": 27.805,
  "homepage": null,
  "imdb_id": "nm0004820",
  "known_for_department": "Acting",
  "place_of_birth": "Cerritos, California, USA",
  "gender": 2,
  "profile_path": "/fw1WnVORNEgYEsaPVfJv9oy3bNa.jpg"
},
{
  "_id": 88072,
  "adult": false,
  "name": "Brittany Curran",
  "biography": "From Wikipedia, the free encyclopedia\n\nBrittany Elizabeth Curran (born June 2, 1990) is an American actress and singer. She is known for her role as Pamela in Go Figure and as Chelsea Brimmer on The Suite Life of Zack & Cody.",
  "also_known_as": [
    "Brittany Elizabeth Curran "
  ],
  "birthday": "1990-06-02",
  "deathday": null,
  "popularity": 19.516,
  "homepage": null,
  "imdb_id": "nm1589004",
  "known_for_department": "Acting",
  "place_of_birth": "Boston, Massachusetts, USA",
  "gender": 1,
  "profile_path": "/agORPIfUB8V93aCnHj7zbOIYlg9.jpg"
},
{
  "_id": 99166,
  "adult": false,
  "name": "Will Blagrove",
  "biography": "William Blagrove (born May 6, 1981) is an American actor. He portrayed Rusty - Metropolis Cop in the Ultimate Edition of Batman v Superman: Dawn of Justice.",
  "also_known_as": [],
  "birthday": "1981-05-06",
  "deathday": null,
  "popularity": 5.117,
  "homepage": null,
  "imdb_id": "nm1309437",
  "known_for_department": "Acting",
  "place_of_birth": "Queens, New York City, New York, USA",
  "gender": 2,
  "profile_path": "/iYmDCSLqiE3VKBOfH7xQQ7pYpEC.jpg"
},
{
  "_id": 1021529,
  "adult": false,
  "name": "Chris Hayes",
  "biography": "Timothy Christopher Hayes was the first of three sons born to Tim Hayes, an executive for Bayer Healthcare, and Susan Hayes, an interior refiner. Though Hayes took his first breaths in San Antonio, Texas, his time in the Lone Star State would be short-lived, due to the demands of his father's career. In fact, Hayes moved around to 8 different states as a child before eventually settling in Chester, New Jersey at the age of 10.",
  "also_known_as": [],
  "birthday": null,
  "deathday": null,
  "popularity": 1.613,
  "homepage": null,
  "imdb_id": "nm3252890",
  "known_for_department": "Acting",
  "place_of_birth": "San Antonio, Texas, USA",
  "gender": 2,
  "profile_path": "/kpFFYFxb1dKRjRLfdEjKekYjAFr.jpg"
},
{
  "_id": 37153,
  "adult": false,
  "name": "Zoë Kravitz",
  "biography": "Zoë Isabella Kravitz (born December 1, 1988) is an American actress, singer, and model. The daughter of actor-musician Lenny Kravitz and actress Lisa Bonet, she made her acting debut in the romantic comedy film No Reservations (2007), and had her breakthrough portraying Angel Salvadore in the superhero film X-Men: First Class (2011), which earned her nominations for a Teen Choice Award and a Scream Award. She rose to prominence playing Christina in The Divergent Series (2014–2016) and Leta Lestrange in the Fantastic Beasts film series (2016–2018).\n\nKravitz earned acclaim for her lead roles in the HBO drama series Big Little Lies (2017–2019), which earned her a Screen Actors Guild Award nomination, and the Hulu romantic comedy series High Fidelity (2020), for which she won a Black Reel Award and received a nomination for a Satellite Award. She voiced Catwoman in The Lego Batman Movie (2017), and will reprise the role in Matt Reeves' DC film The Batman (2022); she additionally provided the voice of Mary Jane Watson in Spider-Man: Into the Spider-Verse (2018). She appeared as Toast the Knowing in Mad Max: Fury Road (2015), and has starred in numerous independent films, including Dope (2015), Adam Green's Aladdin (2016), and Gemini (2017).\n\nIn addition to acting, Kravitz works as a fashion model and musician. As of 2017, she is the face of YSL Beauté. Kravitz has also starred in campaigns for Tiffany & Co., Vera Wang, Balenciaga, Alexander Wang, Coach New York, Tumi, and Calvin Klein. She fronts the band Lolawolf and released the albums Calm Down in 2014 and Tenderness in 2020.",
  "also_known_as": [
    "Zoë Isabella Kravitz",
    "Zoe Kravitz",
    "Ζόι Κράβιτζ",
    "Зои Кравиц",
    "佐伊·克罗维兹",
    "Зої Кравіц",
    "조이 크래비츠",
    "ゾーイ・クラヴィッツ",
    "ゾーイ・イザベラ・クラヴィッツ"
  ],
  "birthday": "1988-12-01",
  "deathday": null,
  "popularity": 17.654,
  "homepage": null,
  "imdb_id": "nm2368789",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 1,
  "profile_path": "/A8Ig9UHh8NSiUGg3xChcoF7749w.jpg"
},
{
  "_id": 94185,
  "adult": false,
  "name": "Shailene Woodley",
  "biography": "Shailene Diann Woodley (born November 15, 1991) is an American actress. Born in San Bernardino, California, Woodley was raised in Simi Valley, and started modeling at the age of four and began acting professionally in minor television roles. She first gained prominence for her starring role as Amy Juergens in the ABC Family teen drama series The Secret Life of the American Teenager (2008–2013). She subsequently starred in the films The Descendants (2011) and The Spectacular Now (2013), receiving a nomination for her first Golden Globe Award for the former.\n\nWoodley achieved wider recognition for her starring role as a teenaged cancer patient in the romantic drama The Fault in Our Stars (2014) and as Beatrice Prior in the science-fiction trilogy The Divergent Series (2014–2016). She played a sexual assault survivor in the HBO drama series Big Little Lies (2017–2019), for which she was nominated for a Golden Globe Award and a Primetime Emmy Award. She has since played supporting roles in the films Snowden (2016), The Mauritanian (2021) and The Fallout (2021), and starred in Adrift (2018) and The Last Letter from Your Lover (2021).\n\nWoodley is also an environmental activist and serves as a board member of the political action committee, Our Revolution.",
  "also_known_as": [
    "쉐일린 우들리",
    "شیلین وودلی",
    "谢琳·伍德利",
    "Shailene Diann Woodley ",
    "שיילין וודלי"
  ],
  "birthday": "1991-11-15",
  "deathday": null,
  "popularity": 34.711,
  "homepage": null,
  "imdb_id": "nm0940362",
  "known_for_department": "Acting",
  "place_of_birth": "Simi Valley, California, USA",
  "gender": 1,
  "profile_path": "/xdyUPTEvM1i8CzfmXUO9yLnBDQp.jpg"
},
{
  "_id": 1380297,
  "adult": false,
  "name": "Molly Pan",
  "biography": "Molly Pan is an actress.",
  "also_known_as": [],
  "birthday": null,
  "deathday": null,
  "popularity": 2.164,
  "homepage": null,
  "imdb_id": "nm4570659",
  "known_for_department": "Acting",
  "place_of_birth": null,
  "gender": 1,
  "profile_path": "/kHXELSmT3lNzfGPEZfASbz9ovus.jpg"
},
{
  "_id": 1328,
  "adult": false,
  "name": "Sean Astin",
  "biography": "Sean Astin (born February 25, 1971) is an American film actor, director, and producer better known for his film roles as Mikey Walsh in The Goonies, the title character of Rudy, and Samwise Gamgee in the Lord of the Rings trilogy. In television, he appeared as Lynn McGill in the fifth season of 24. He also provided the voice for the title character in Disney's Special Agent Oso.",
  "also_known_as": [
    "Шон Эстин",
    "Sean Patrick Duke",
    "ショーン・アスティン"
  ],
  "birthday": "1971-02-25",
  "deathday": null,
  "popularity": 34.657,
  "homepage": null,
  "imdb_id": "nm0000276",
  "known_for_department": "Acting",
  "place_of_birth": "Santa Monica, California, USA",
  "gender": 2,
  "profile_path": "/ywH1VvdwqlcnuwUVr0pV0HUZJQA.jpg"
},
{
  "_id": 61011,
  "adult": false,
  "name": "Clarke Peters",
  "biography": "​From Wikipedia, the free encyclopedia.\n\nClarke Peters (born 7 April 1952) is an American actor, singer, writer and director best known for his role as Detective Lester Freamon on the HBO drama The Wire.",
  "also_known_as": [
    "Peter Clarke",
    "클라크 피터스"
  ],
  "birthday": "1952-04-07",
  "deathday": null,
  "popularity": 18.057,
  "homepage": null,
  "imdb_id": "nm0676370",
  "known_for_department": "Acting",
  "place_of_birth": "New York City, New York, USA",
  "gender": 2,
  "profile_path": "/ouDHDpocxXgXrosF3vShAEkOjHL.jpg"
},
{
  "_id": 100,
  "adult": false,
  "name": "Scott Speedman",
  "biography": "Scott Speedman (born September 1, 1975) is a British-born Canadian film and television actor. He is best known for playing Ben Covington in the coming-of-age television drama Felicity and Lycan-Vampire hybrid Michael Corvin in the gothic horror/action Underworld films.\n\nDescription above from the Wikipedia article Scott Speedman, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "Robert Scott Speedman"
  ],
  "birthday": "1975-09-01",
  "deathday": null,
  "popularity": 36.193,
  "homepage": "http://ggagency.ca/speedman/",
  "imdb_id": "nm0005454",
  "known_for_department": "Acting",
  "place_of_birth": "London, England, UK",
  "gender": 2,
  "profile_path": "/d0fzWMIzsMAXS2M04SKFMof6zQX.jpg"
},
{
  "_id": 1213278,
  "adult": false,
  "name": "Eliza Taylor",
  "biography": "Eliza Jane Taylor (born 24 October 1989) is an Australian actress who is perhaps best known for her regular role as Janae Timmins on the Australian television series, Neighbours.\n\nEliza has just finished feature film Patrick (2013), alongside Rachael Griffiths and nabbed the lead in CW pilot, The 100. The 100 is Taylor's first American production.\n\nTaylor has married to Australian actor Bob Morley, his co-star in The 100, since 2019.",
  "also_known_as": [
    "Eliza Taylor-Cotter",
    "Eliza Cotter",
    "Elizer Taylor",
    "Элайза Тейлор",
    "Eliza Jane Taylor",
    "Ελάιζα Τέιλορ",
    "Елиза Джейн Тейлър-Котър",
    "الیزا تیلور"
  ],
  "birthday": "1989-10-24",
  "deathday": null,
  "popularity": 36.641,
  "homepage": null,
  "imdb_id": "nm1343638",
  "known_for_department": "Acting",
  "place_of_birth": "Melbourne, Victoria, Australia",
  "gender": 1,
  "profile_path": "/igWylWFncQPoJZcmwRsACUYXtyQ.jpg"
},
{
  "_id": 20750,
  "adult": false,
  "name": "Judy Greer",
  "biography": "Judith Therese Evans (born July 20, 1975), known professionally as Judy Greer, is an American actress. She is primarily known as a character actress, who has appeared in a wide variety of films. She first rose to prominence in the late 1990s to early 2000s, appearing in the films Jawbreaker (1999), What Women Want (2000), 13 Going on 30 (2004), 27 Dresses (2008), and Love & Other Drugs (2010). Greer also expanded into other genres, with roles in such films as Adaptation (2002), The Village (2004), The Descendants (2011), Carrie (2013), Dawn of the Planet of the Apes (2014), Jurassic World (2015), Ant-Man (2015), War for the Planet of the Apes (2017), Ant-Man and the Wasp (2018), Halloween (2018), and Halloween Kills (2021). She made her directorial debut with the comedy-drama film A Happening of Monumental Proportions (2017). On television, Greer is best known for her starring voice role as Cheryl Tunt in the FXX animated comedy series Archer (2009–present). She also had roles in the comedy series The Big Bang Theory (2007–2019), Arrested Development (2003–2006, 2013-2019), Two and a Half Men (2003–2015), Married (2014–2015), and Kidding (2018–2020).\n\nDescription above from the Wikipedia article Judy Greer, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "Judith Therese Evans",
    "Judy Evans Greer",
    "주디 그리어",
    "Джуді Грір"
  ],
  "birthday": "1975-07-20",
  "deathday": null,
  "popularity": 36.281,
  "homepage": null,
  "imdb_id": "nm0339460",
  "known_for_department": "Acting",
  "place_of_birth": "Detroit, Michigan, USA",
  "gender": 1,
  "profile_path": "/qiwvGgbbgwiE8gA4oBQpFnTNzl2.jpg"
},
{
  "_id": 17486,
  "adult": false,
  "name": "Alison Pill",
  "biography": "Alison Pill (born November 27, 1985) is a Canadian actress. A former child actress, Pill began her career at age 12, appearing in numerous films and television series. She transitioned to adult roles and her breakthrough came with the television series The Book of Daniel (2006). That same year, she was nominated for a Tony Award for Best Featured Actress in a Play for her performance in The Lieutenant of Inishmore (2006). Pill had prominent roles in the films Confessions of a Teenage Drama Queen (2004), Plain Truth (2004), Milk (2008), Scott Pilgrim vs. the World (2010), Midnight in Paris (2011), Hail, Caesar! (2016), Vice (2018), the television series In Treatment (2009), The Pillars of the Earth (2010), The Newsroom (2012–2014), American Horror Story: Cult (2017), Star Trek: Picard (2020–2022), Devs (2020), and Them (2021).",
  "also_known_as": [
    "알리슨 필",
    "艾莉森·皮爾"
  ],
  "birthday": "1985-11-27",
  "deathday": null,
  "popularity": 21.252,
  "homepage": null,
  "imdb_id": "nm0683467",
  "known_for_department": "Acting",
  "place_of_birth": "Toronto, Ontario, Canada",
  "gender": 1,
  "profile_path": "/qQm7UR0G8Kcxn7SKTNl6fdSfcTm.jpg"
},
{
  "_id": 19537,
  "adult": false,
  "name": "Megan Fox",
  "biography": "Megan Denise Fox (born May 16, 1986) is an American actress. She made her acting debut in the family film Holiday in the Sun (2001), which was followed by numerous supporting roles in film and television, such as the teen musical comedy Confessions of a Teenage Drama Queen (2004), as well as a starring role in the ABC sitcom Hope & Faith (2004–2006). Her breakout role was as Mikaela Banes in the blockbuster action film Transformers (2007), which she reprised in its sequel Transformers: Revenge of the Fallen (2009). She also portrayed the titular character in the horror comedy Jennifer's Body (2009), starred as April O'Neil in the superhero action film Teenage Mutant Ninja Turtles (2014) and its sequel Teenage Mutant Ninja Turtles: Out of the Shadows (2016), and starred as Reagan Lucas in the fifth and sixth seasons of the Fox sitcom New Girl (2016–2017).\n\nFox has also made appearances in numerous magazines such as Maxim, Rolling Stone, and FHM. She is the recipient of several accolades, including two Scream Awards and four Teen Choice Awards.",
  "also_known_as": [
    "Megan Denise Fox",
    "Μέγκαν Ντενίζ Φοξ",
    "Μέγκαν Φοξ",
    "ميغان دينيس فوكس",
    "메간 폭스",
    "Megan Green",
    "梅根·福克斯",
    "ミーガン・フォックス",
    "מייגן פוקס",
    "مگان فاکس"
  ],
  "birthday": "1986-05-16",
  "deathday": null,
  "popularity": 79.266,
  "homepage": null,
  "imdb_id": "nm1083271",
  "known_for_department": "Acting",
  "place_of_birth": "Oak Ridge, Tennessee, USA",
  "gender": 1,
  "profile_path": "/smjWHgaVWUnAoxeg65gL4NE5Gnp.jpg"
},
{
  "_id": 10556,
  "adult": false,
  "name": "Carol Kane",
  "biography": "Carolyn Laurie Kane (born June 18, 1952) is an American actress and comedian.\n\nShe became known in the 1970s in films such as Hester Street (for which she received an Oscar nomination) and Annie Hall. She appeared on the television series Taxi in the early 1980s, as Simka Gravas, the wife of Latka, the character played by Andy Kaufman, winning two Emmy Awards for her work. She has played the character of Madame Morrible in the musical Wicked, both in regional productions and on Broadway from 2005 to 2014. From 2015 to 2018 she was a main cast member on the Netflix original series Unbreakable Kimmy Schmidt, in which she played Lillian Kaushtupper.",
  "also_known_as": [
    " Lisa LeBlanc ",
    "Carolyn Laurie Kane"
  ],
  "birthday": "1952-06-18",
  "deathday": null,
  "popularity": 27.352,
  "homepage": null,
  "imdb_id": "nm0001406",
  "known_for_department": "Acting",
  "place_of_birth": "Cleveland, Ohio, USA",
  "gender": 1,
  "profile_path": "/dm3Ci8XuVYZBqqlYtaLgth94VUe.jpg"
},
{
  "_id": 64306,
  "adult": false,
  "name": "Barbara Mamabolo",
  "biography": "",
  "also_known_as": [],
  "birthday": "1986-01-01",
  "deathday": null,
  "popularity": 3.16,
  "homepage": null,
  "imdb_id": "nm0540980",
  "known_for_department": "Acting",
  "place_of_birth": "Thornhill, Ontario, Canada",
  "gender": 1,
  "profile_path": "/8BqgeuDfyekpkeghVwJeLzPQOv0.jpg"
},
{
  "_id": 51995,
  "adult": false,
  "name": "Theo Rossi",
  "biography": "Theo Rossi (born John Theodore Rossi on June 4, 1975 in Staten Island, New York) is an American actor, best known for his role on the FX series Sons of Anarchy as Juan Carlos \"Juice\" Ortiz.\n\nTheo Rossi (left) joins Dayton Callie (seated) and Kim Coates (right) along with an unidentified individual during a USO visit in Southwest Asia.\n\nRossi attended SUNY Albany from 1994–1998, and afterwards started appearing in commercials for McDonald's, Nissan, and Bud Light.\n\nSince 2001, Rossi has guest starred in multiple television shows such as Veronica Mars, Bones, Boston Public, American Dreams, Heist, Las Vegas and Grey's Anatomy. In 2008, he was cast as the recurring role of \"Juice\" Ortiz in the series Sons of Anarchy, his best known role to date. Due to popular response, Rossi was upgraded to regular castmember in the second season.\n\nAs a film actor he starred in the movie The Challenge with Mary-Kate and Ashley Olsen, Code Breakers, and had a small part in Cloverfield. He will appear in the upcoming films Kill Theory, The Informers and Fencewalker.\n\nDescription above from the Wikipedia article Theo Rossi, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "John Theodore \"Theo\" Rossi",
    "Θίο Ρόσι"
  ],
  "birthday": "1975-06-04",
  "deathday": null,
  "popularity": 12.429,
  "homepage": null,
  "imdb_id": "nm0744331",
  "known_for_department": "Acting",
  "place_of_birth": "Staten Island, New York City, New York, USA",
  "gender": 2,
  "profile_path": "/344QE41Jileu4OE41cmYgBxc5BF.jpg"
},
{
  "_id": 2322380,
  "adult": false,
  "name": "Tanyell Waivers",
  "biography": "Tanyell Waivers was born in New Orleans, Louisiana, USA. She is an actress and producer, known for Queen Sugar (2016), Ma (2019) and Family Reunion (2019).",
  "also_known_as": [],
  "birthday": "1990-01-06",
  "deathday": null,
  "popularity": 9.415,
  "homepage": null,
  "imdb_id": "nm8568732",
  "known_for_department": "Acting",
  "place_of_birth": "New Orleans, Louisiana, USA",
  "gender": 1,
  "profile_path": "/wODjctZVH4jHA4MDnyPbaYqdfVQ.jpg"
},
{
  "_id": 53,
  "adult": false,
  "name": "Peter Stormare",
  "biography": "A Swedish film, stage, voice and television actor as well as a theatrical director, playwright and musician. He is perhaps best known for his roles as John Abruzzi in Prison Break and as Gaear Grimsrud, one of the two kidnappers in Fargo.\n\nPeter Stormare began his acting career at the Royal National Theatre of Sweden, performing for eleven years. In 1990 he became the Associate Artistic Director at the Tokyo Globe Theatre and directed productions of many Shakespeare plays, including \"Hamlet\". In 1993 he moved to New York, where he appeared in English productions. He continues to work in both the United States and his his homeland of Sweden. He resides in Los Angeles, California, USA, with his wife.",
  "also_known_as": [
    "Rolf Peter Ingvar Storm",
    "Петер Стормаре",
    "피터 스토메어",
    "彼得·斯特曼"
  ],
  "birthday": "1953-08-27",
  "deathday": null,
  "popularity": 23.168,
  "homepage": null,
  "imdb_id": "nm0001780",
  "known_for_department": "Acting",
  "place_of_birth": "Arbrå, Gävleborgs län, Sweden",
  "gender": 2,
  "profile_path": "/5muzSVt66Qxc8KuVbq0phZIN9tj.jpg"
},
{
  "_id": 4690,
  "adult": false,
  "name": "Christopher Walken",
  "biography": "Christopher Walken (born Ronald Walken, March 31, 1943) is an American actor. He has appeared in more than 100 films and television programs, including Annie Hall (1977), The Deer Hunter (1978), The Dogs of War (1980), The Dead Zone (1983), A View to a Kill (1985), Batman Returns (1992), True Romance (1993), Pulp Fiction (1994), Antz (1998), Vendetta (1999), Sleepy Hollow (1999), Joe Dirt (2001), Catch Me If You Can (2002), Hairspray (2007), Seven Psychopaths (2012), the first three Prophecy films, The Jungle Book (2016), and Irreplaceable You (2018). He has received a number of awards and nominations, including the Academy Award for Best Supporting Actor for The Deer Hunter.",
  "also_known_as": [
    "크리스토퍼 워컨",
    "كريستوفر واكن",
    "クリストファー・ウォーケン",
    "คริสโตเฟอร์ วอลเคน",
    "克里斯托弗·沃肯",
    "Ronald Walken",
    "Ronnie Walken",
    "כריסטופר ווקן"
  ],
  "birthday": "1943-03-31",
  "deathday": null,
  "popularity": 43.042,
  "homepage": null,
  "imdb_id": "nm0000686",
  "known_for_department": "Acting",
  "place_of_birth": "Queens, New York City, New York, USA",
  "gender": 2,
  "profile_path": "/ApgDL7nudR9T2GpjCG4vESgymO2.jpg"
},
{
  "_id": 86626,
  "adult": false,
  "name": "Aziz Ansari",
  "biography": "Aziz Ansari (born February 23, 1983) is an American actor, writer, and stand-up comedian. He formerly starred as Tom Haverford on the NBC show Parks and Recreation, and has since gone on to co-create, co-produce, and star in two seasons of the critically acclaimed comedy/drama Netflix series, Master of None.",
  "also_known_as": [
    "Αζίζ Ανσάρι"
  ],
  "birthday": "1983-02-23",
  "deathday": null,
  "popularity": 7.934,
  "homepage": "http://azizisbored.tumblr.com/",
  "imdb_id": "nm2106637",
  "known_for_department": "Acting",
  "place_of_birth": " Columbia, South Carolina, USA",
  "gender": 2,
  "profile_path": "/yUeQHM4ycUXrUgRWgKVYKNmKxfJ.jpg"
},
{
  "_id": 1320468,
  "adult": false,
  "name": "Lilli Birdsell",
  "biography": "Lilli Birdsell is an actress and director.",
  "also_known_as": [],
  "birthday": null,
  "deathday": null,
  "popularity": 14.615,
  "homepage": null,
  "imdb_id": "nm0083475",
  "known_for_department": "Acting",
  "place_of_birth": null,
  "gender": 1,
  "profile_path": "/u9c5Xq8uKVRmuIJ2eWsnC2B08Uu.jpg"
},
{
  "_id": 159985,
  "adult": false,
  "name": "Haley Hudson",
  "biography": "Haley Kaye Hudson (born June 14, 1986) is an American actress. She began her career at age 16 after being cast in Disney's remake of Freaky Friday opposite Jamie Lee Curtis and Lindsay Lohan. Hudson played the role of Peg, a member of the rock band Pink Slip and best friend of the main character, played by Lohan. During her teens and 20s, she portrayed many different characters in films and TV shows, including the roles of Debby in Marley & Me, Quinn Hodes in Weeds, Sydney Fields in Terminator: The Sarah Connor Chronicles, and Amanda in both Look and Look: The Series for director Adam Rifkin. In 2012, Hudson starred in the IFC horror film The Pact, which premiered at the Sundance Film Festival to mostly positive reviews. Critics singled her out for her sensitive, visceral portrayal of the blind psychic, Stevie.",
  "also_known_as": [
    "해일리 허드슨"
  ],
  "birthday": "1986-06-14",
  "deathday": null,
  "popularity": 8.247,
  "homepage": null,
  "imdb_id": "nm1268839",
  "known_for_department": "Acting",
  "place_of_birth": "Los Angeles, California, USA",
  "gender": 1,
  "profile_path": "/yyB5RFaG83XdwqbqFEBptwi9SuG.jpg"
},
{
  "_id": 56323,
  "adult": false,
  "name": "Tina Fey",
  "biography": "Elizabeth Stamatina 'Tina' Fey (born May 18, 1970) is an American actress, comedian, writer, and producer, known for her work on the NBC sketch comedy series Saturday Night Live (SNL, 1997–2006), the critically acclaimed NBC comedy series 30 Rock (2006–2013), and such films as Mean Girls (2004), Baby Mama (2008), Date Night (2010), and Admission (2013). She has received eight Emmy Awards, two Golden Globe Awards, five Screen Actors Guild Awards, four Writers Guild of America Awards and was nominated for a Grammy Award for her autobiographical book Bossypants, which topped the The New York Times Best Seller list for five weeks.\n\nShe first broke into comedy as a featured player in the Chicago-based improv comedy group The Second City. She then joined SNL as a writer, later becoming head writer and a performer, known for her position as co-anchor in the Weekend Update segment. In 2004, she adapted the screenplay Mean Girls in which she also co-starred.\n\nAfter leaving SNL in 2006, she created the television series 30 Rock, a situation comedy loosely based on her experiences at SNL. In the series, she portrays the head writer of a fictional sketch comedy series. In 2008, she starred in the comedy film Baby Mama, alongside former SNL co-star Amy Poehler. She next appeared alongside Steve Carell in the 2010 comedy film Date Night and with Will Ferrell in the animated film Megamind.\n\nIn 2008, the Associated Press (AP) gave her the AP Entertainer of the Year award for her satirical portrayal of Republican vice presidential candidate Sarah Palin in a guest appearance on SNL. In 2010, she was the recipient of the Mark Twain Prize for American Humor, the youngest-ever winner of the award.\n\nOn January 13, 2013, she hosted the Golden Globe Awards with her long-time friend and fellow comedian, Amy Poehler. Their performance was critically acclaimed. The duo hosted again the following year to similar acclaim, generating the highest ratings for the annual ceremony in ten years.",
  "also_known_as": [
    "Elizabeth Stamatina Fey",
    "Elizabeth Stamatina",
    "Tina Faye",
    "Elizabeth Fey",
    "티나 페이",
    "Тіна Фей",
    "Елізабет Фей"
  ],
  "birthday": "1970-05-18",
  "deathday": null,
  "popularity": 29.939,
  "homepage": null,
  "imdb_id": "nm0275486",
  "known_for_department": "Acting",
  "place_of_birth": "Upper Darby, Pennsylvania, USA",
  "gender": 1,
  "profile_path": "/yPTAi1iucXf85UpiFPtyiTSM6do.jpg"
},
{
  "_id": 4495,
  "adult": false,
  "name": "Steve Carell",
  "biography": "Steven John Carell (born August 16, 1962) is an American actor and comedian. He played Michael Scott in The Office (2005–2011; 2013), NBC’s adaptation of the British series created by Stephen Merchant and Ricky Gervais, where Carell also worked as an occasional producer, writer and director. Carell has received numerous accolades for his performances in both film and television, including the Golden Globe Award for Best Actor – Television Series Musical or Comedy for his work on The Office. He was recognized as \"America's Funniest Man\" by Life magazine.\n\nCarell gained recognition as a correspondent on The Daily Show with Jon Stewart from 1999 to 2005. He went on to star in several comedy films, including Anchorman: The Legend of Ron Burgundy (2004) and its 2013 sequel, as well as The 40-Year-Old Virgin (2005), Evan Almighty (2007), Get Smart (2008), Date Night (2010), Crazy, Stupid, Love (2011), and The Way, Way Back (2013). He also voice acted in Over the Hedge (2006), Horton Hears a Who! (2008) and the Despicable Me franchise (2010–present).\n\nCarell began to shift into more dramatic roles in the 2010s, with his role as wrestling coach and convicted murderer John Eleuthère du Pont in the drama film Foxcatcher (2014) earning him, among various honors, nominations for the Academy Award for Best Actor, the Golden Globe Award for Best Actor – Motion Picture Drama and the BAFTA Award for Best Actor in a Supporting Role. He also starred in Little Miss Sunshine (2006), The Big Short (2015), and Battle of the Sexes (2017), the last two earning him his eighth and ninth Golden Globe Award nominations, respectively. In 2018, he re-teamed with Anchorman and The Big Short director Adam McKay for the Dick Cheney biographical film Vice, in which he portrayed Donald Rumsfeld, and played journalist David Sheff in the drama film Beautiful Boy.\n\nCarell returned to television as the co-creator of the TBS comedy series Angie Tribeca (2016–2018), which he developed with his wife, Nancy Carell. He starred as Mitch Kessler in the Apple TV+ drama series The Morning Show (2019–present), for which he received a nomination for the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series. He also returned to comedy with the lead role of General Mark R. Naird in the Netflix sitcom Space Force (2020–present).",
  "also_known_as": [
    "Steven Carrel",
    "Steven Carel ",
    "Steve Carel ",
    "Steven Carell",
    "Стив Карелл",
    "ستيف كارل",
    "スティーヴ・カレル",
    "스티브 커렐",
    "สตีฟ คาเรล",
    "史提夫·加維",
    "Steven John \"Steve\" Carell",
    "Steven John Carell",
    "Στίβεν Τζον Καρέλ",
    "Στίβεν Καρέλ",
    "סטיב קארל",
    "Стів Карелл"
  ],
  "birthday": "1962-08-16",
  "deathday": null,
  "popularity": 51.228,
  "homepage": null,
  "imdb_id": "nm0136797",
  "known_for_department": "Acting",
  "place_of_birth": "Concord, Massachusetts, USA",
  "gender": 2,
  "profile_path": "/dA6n0qpnlMFBlTr8SBULsZbWkvn.jpg"
},
{
  "_id": 85825,
  "adult": false,
  "name": "Leighton Meester",
  "biography": "Leighton Marissa Meester (born April 9, 1986) is an American actress and singer. She is mostly known for her starring role as Blair Waldorf in the teen drama series Gossip Girl (2007–12). She has also appeared in the 2010 country drama film Country Strong, the 2011 thriller The Roommate, the 2011 romantic-comedy Monte Carlo, and the comedies The Oranges (2011) and That's My Boy (2012). Meester made her Broadway debut in 2014 in Of Mice and Men.\n\nDescription above from the Wikipedia article Leighton Meester, licensed under CC-BY-SA, full list of contributors on Wikipedia.",
  "also_known_as": [
    "レイトン・ミースター",
    "Leighton Marissa Meester",
    "\t レイトン・メーステル",
    "레이턴 미스터",
    "\t 레이튼 미스터",
    "لايتن ميستر",
    "لیتون میستر",
    "Leighton Meesterová",
    "\t Λέιτον Μίστερ",
    "\t 麗頓·麥斯達",
    "蕾頓·米絲特",
    "琳頓·米斯特",
    "莱顿·梅斯特",
    "לייטון מיסטר"
  ],
  "birthday": "1986-04-09",
  "deathday": null,
  "popularity": 43.329,
  "homepage": null,
  "imdb_id": "nm1015262",
  "known_for_department": "Acting",
  "place_of_birth": "Fort Worth, Texas, USA",
  "gender": 1,
  "profile_path": "/6P8sa2eR2wpNkA1n1NVHREaeXPV.jpg"
},
{
  "_id": 54697,
  "adult": false,
  "name": "Dave Franco",
  "biography": "David John Franco (born June 12, 1985) is an American actor and director. He began his career with small roles in films such as Superbad (2007) and Charlie St. Cloud (2010). Following a starring role in the ninth season of the comedy series Scrubs, Franco had his film breakthrough as a supporting role in the buddy comedy film 21 Jump Street (2012).\n\nFranco has also starred in Fright Night (2011), Now You See Me (2013) and its sequel Now You See Me 2 (2016), Neighbors (2014), Nerve (2016), and The Disaster Artist (2017). In 2020, he made his directorial debut with The Rental, which starred his wife Alison Brie.\n\n​From Wikipedia, the free encyclopedia",
  "also_known_as": [
    "Дэйв Франко",
    "戴夫·弗兰科",
    "戴夫·法蘭科"
  ],
  "birthday": "1985-06-12",
  "deathday": null,
  "popularity": 36.027,
  "homepage": null,
  "imdb_id": "nm2002649",
  "known_for_department": "Acting",
  "place_of_birth": "Palo Alto, California, USA",
  "gender": 2,
  "profile_path": "/j48eRArsXapbfXZfw9Fik7PlJSo.jpg"
},
{
  "_id": 1533,
  "adult": false,
  "name": "Andie MacDowell",
  "biography": "Rosalie Anderson MacDowell (born April 21, 1958) is an American actress and former fashion model. MacDowell's known for her starring film roles in romantic comedies and dramas. MacDowell has modeled for Calvin Klein and has been a spokeswoman for L'Oréal since 1986.\n\nHer early films include Greystoke: The Legend of Tarzan, Lord of the Apes (1984) and the Brat Pack vehicle film St. Elmo's Fire (1985). Her breakout role was in Sex, Lies, and Videotape (1989) which earned her the Independent Spirit Award for Best Female Lead and a nomination for a Golden Globe Award for Best Actress – Motion Picture Drama. She then starred in a series of films including Green Card (1990), Groundhog Day (1993), Short Cuts (1993), Four Weddings and a Funeral (1994), Michael (1996), Multiplicity (1996), and The Muse (1999).\n\nShe's also known for her supporting film roles in Beauty Shop (2005), Footloose (2011), Magic Mike XXL (2015), Love After Love (2017), and Ready or Not (2019). She co-starred and opposite her daughter Margaret Qualley in the Netflix miniseries Maid (2021) for which she was nominated for a Golden Globe Award for Best Supporting Actress – Series, Miniseries or Television Film.",
  "also_known_as": [
    "Энди МакДауэлл",
    "Енді МакДавелл",
    "安迪·麥杜維"
  ],
  "birthday": "1958-04-21",
  "deathday": null,
  "popularity": 52.867,
  "homepage": null,
  "imdb_id": "nm0000510",
  "known_for_department": "Acting",
  "place_of_birth": "Gaffney, South Carolina, USA",
  "gender": 1,
  "profile_path": "/akeheO4i3cR1HpSU8yu9HrLcsKm.jpg"
},
{
  "_id": 53256,
  "adult": false,
  "name": "Terry Crews",
  "biography": "Terrence Alan Crews (born July 30, 1968) is an American actor, comedian, activist, artist, bodybuilder and former professional football player. Crews played Julius Rock on the UPN/CW sitcom Everybody Hates Chris. He hosted the U.S. version of the game show Who Wants to Be a Millionaire and starred in the BET reality series The Family Crews. He appeared in films such as Friday After Next (2002), White Chicks (2004), Idiocracy (2006), Blended (2014), and the Expendables series. Since 2013, he has played NYPD Lieutenant Terry Jeffords in the sitcom Brooklyn Nine-Nine. He began hosting America's Got Talent in 2019, following his involvement in the same role for the program's spin-off series, America's Got Talent: The Champions.\n\nCrews played as a defensive end and linebacker in the National Football League (NFL), for the Los Angeles Rams, San Diego Chargers, and Washington Redskins, as well as in the World League of American Football (WLAF) with the Rhein Fire, and college football at Western Michigan University.\n\nCrews, a public advocate for women's rights and activist against sexism, has shared stories of the abuse his family endured at the hands of his violent father. He was included among the group of people named as Time Person of the Year in 2017 for going public with stories of sexual assault.\n\nDescription above from the Wikipedia article Terry Crews, licensed under CC-BY-SA, full list of contributors on Wikipedia",
  "also_known_as": [
    "Terrence Alan Crews",
    "Squeegee Lo",
    "Terry Alan Crews",
    "Henry David Thoreau",
    "Terry Crews Jr.",
    "T-Money",
    "테리 크루즈",
    "Террі Крюс",
    "泰瑞・克魯斯",
    "Терри Крюс"
  ],
  "birthday": "1968-07-30",
  "deathday": null,
  "popularity": 35.425,
  "homepage": "http://www.terrycrews.com/",
  "imdb_id": "nm0187719",
  "known_for_department": "Acting",
  "place_of_birth": "Flint, Michigan, USA ",
  "gender": 2,
  "profile_path": "/pxTY4SglLo5hFcMH00MxPeC5u55.jpg"
},
{
  "_id": 1077804,
  "adult": false,
  "name": "Haley Higgins",
  "biography": "",
  "also_known_as": [],
  "birthday": null,
  "deathday": null,
  "popularity": 4.241,
  "homepage": null,
  "imdb_id": "nm3228369",
  "known_for_department": "Acting",
  "place_of_birth": null,
  "gender": 1,
  "profile_path": "/7rHsf37o6DbYf4vcGC6rBEm4uW5.jpg"
}]